[
  {
    "id": "1",
    "name": "Single Serve Shakshuka",
    "category": "vegetarian",
    "ingredients": [
      "1 cup cherry tomatoes",
      "1/4 - 1/2 tsp chili flakes",
      "1/4 - 1/2 cup cottage cheese",
      "2-3 eggs",
      "Everything but the bagel seasoning (optional)",
      "Fresh herbs (dill, parsley or your favorite)",
      "Bread to serve",
      "1 clove garlic (optional)",
      "Salt",
      "Olive oil"
    ],
    "instructions": "Start your tomatoes. Add tomatoes to a small frying pan, drizzle with a bit of oil and salt, cover and cook for 15 minutes. As tomatoes start to open and turn jammy, squish them so they turn saucy. At this point, add chili flakes and continue to cook until broken down into a sauce. Make your toast. While your tomatoes cook, either toast or grill your bread. To grill, heat a good glug olive oil in a small frying pan over medium heat. Once hot, add bread and grill until golden on both sides and sprinkle with salt. Once bread is toasted or grilled, take a peeled garlic clove and rub it across the bread. Finish your shakshuka. Once tomatoes are cooked, add dollops of cottage cheese throughout your pan. Make little pockets in your tomatoes with a spoon and crack eggs in, cover and cook for 3-6 minutes (4 for soft yolk, 6 for hard). Remove from heat, remove lid and sprinkle with EBTB seasoning or sesame seeds, salt, and fresh herbs. Serve with toast.",
    "source": "20_Minute_Single_Serve_Shakshuka.pdf",
    "servings": "1",
    "time": "20 minutes"
  },
  {
    "id": "2",
    "name": "Cauliflower Bolognese",
    "category": "pasta",
    "ingredients": [
      "12 oz mushrooms (shiitake or crimini), stems removed",
      "1 medium head of cauliflower (about 2 1/4 lb), broken into florets",
      "1/4 cup plus 2 Tbsp extra-virgin olive oil, plus more for drizzling",
      "4 Tbsp unsalted butter, divided",
      "1 large onion, finely chopped",
      "6 garlic cloves, thinly sliced",
      "1 chile (serrano, Holland, or Fresno), thinly sliced",
      "1 Tbsp finely chopped rosemary",
      "1/3 cup double-concentrated tomato paste",
      "Kosher salt",
      "1 lb rigatoni",
      "2 oz finely grated Parmesan (about 1 cup), plus more for serving",
      "3 Tbsp finely chopped parsley",
      "1/2 lemon"
    ],
    "instructions": "Pulse mushrooms in a food processor until finely chopped. Transfer to a small bowl. Wipe out food processor bowl. Working in 3 batches, pulse cauliflower in food processor until pieces are about the size of a grain of rice. Heat 1/4 cup oil and 2 Tbsp butter in a Dutch oven over medium-high. Add mushrooms and cook, stirring occasionally, until golden brown, 4-6 minutes. Add onion and 2 Tbsp oil. Cook until onion is very soft and golden brown, 6-8 minutes. Add garlic, chile, and rosemary and cook until garlic is softened, about 3 minutes. Add tomato paste and cook until slightly darkened, about 2 minutes. Add cauliflower and cook until it begins to stick to bottom of pot, 6-8 minutes. Season with salt. Meanwhile, cook pasta until almost al dente. Using a slotted spoon, transfer pasta to pot with sauce. Add 1 cup Parmesan, remaining 2 Tbsp butter, and 1 cup pasta cooking liquid. Increase heat to medium and cook until pasta is al dente and sauce is clinging to pasta, about 3 minutes. Remove from heat and stir in parsley. Finely zest lemon over pasta. Divide among bowls and top with more Parmesan.",
    "source": "Cauliflower Bolognese Recipe _ Bon Appétit copy.pdf",
    "servings": "6",
    "time": "45 minutes"
  },
  {
    "id": "3",
    "name": "Turkey Stuffing Meatballs",
    "category": "chicken",
    "ingredients": [
      "1 1/2 cups (1/2-inch) sourdough or white bread cubes",
      "1/2 cup olive oil",
      "1/2 cup chicken stock",
      "1/2 cup finely chopped white onion",
      "1/2 cup finely chopped celery",
      "2 teaspoons dried sage",
      "1 teaspoon dried thyme",
      "1 teaspoon onion powder",
      "1 teaspoon celery salt",
      "1 large egg",
      "Salt and freshly ground black pepper",
      "Crushed red pepper",
      "1 pound ground turkey (preferably 85 percent lean)",
      "Gravy or cranberry sauce, for serving"
    ],
    "instructions": "Heat oven to 350 degrees. Spread the bread cubes on a small sheet pan and bake until brittle, about 10 minutes. Cool completely. Reset oven to 400 degrees. Add the bread cubes, olive oil, chicken stock, onion, celery, sage, thyme, onion powder, celery salt, egg, 1 teaspoon salt, 1 teaspoon black pepper and a pinch of red pepper to a bowl and mix. Let sit for up to 15 minutes to ensure the bread is fully moistened. Add turkey and mix until just combined, being careful not to overmix. Form the meat mixture into 15 balls and place on a baking sheet. Bake for 14 to 16 minutes, until cooked through and the edges have browned. Remove from oven and let rest for 5 minutes. Serve with gravy or cranberry sauce.",
    "source": "dan pelosi Turkey Stuffing Meatballs Recipe.pdf",
    "servings": "15 meatballs",
    "time": "1 hour"
  },
  {
    "id": "4",
    "name": "Kale Salad with Pecorino and Walnuts",
    "category": "salad",
    "ingredients": [
      "1/2 cup walnut halves or pieces",
      "1/4 cup golden raisins",
      "1 tablespoon white wine vinegar",
      "1 tablespoon water",
      "1/4 cup panko or homemade breadcrumbs",
      "1 tiny clove garlic, minced or pressed",
      "Coarse or kosher salt",
      "3 tablespoons olive oil",
      "1 bunch tuscan kale (about 14 ounces)",
      "2 ounces pecorino cheese, grated (1/2 cup)",
      "Juice of half a lemon",
      "Freshly ground black pepper or red pepper flakes"
    ],
    "instructions": "Heat oven to 350. Toast walnuts on a baking sheet for 10 minutes, tossing once. Let cool and coarsely chop. In a small saucepan over low heat, simmer white wine vinegar, water and raisins for 5 minutes, until plump and soft. Set aside. Toast bread crumbs, garlic and 2 teaspoons olive oil in a skillet with a pinch of salt until golden. Set aside. Trim heavy stems off kale and remove ribs. Stack sections of leaves and roll them into a tube, then cut them into very thin ribbons crosswise. Put kale in a large bowl. Add pecorino, walnuts and raisins, remaining 2 tablespoons olive oil and lemon juice and toss until all the kale ribbons are coated. Season with salt, pepper and reserved vinegar mixture. Let sit for 10 minutes. Toss with breadcrumbs before serving.",
    "source": "kale salad with pecorino and walnuts – smitten kitchen.pdf",
    "servings": "4",
    "time": "30 minutes"
  },
  {
    "id": "5",
    "name": "Red Lentil Soup",
    "category": "soup",
    "ingredients": [
      "3 tablespoons olive oil, plus more for drizzling",
      "1 large onion, chopped",
      "2 garlic cloves, minced",
      "1 tablespoon tomato paste",
      "1 teaspoon ground cumin",
      "Salt and black pepper",
      "Pinch of chili powder or ground cayenne",
      "1 quart chicken or vegetable broth",
      "1 cup red lentils",
      "1 large carrot, peeled and diced",
      "Juice of 1/2 lemon",
      "3 tablespoons chopped fresh cilantro"
    ],
    "instructions": "In a large pot, heat 3 tablespoons oil over high until hot and shimmering. Add onion and garlic, and sauté until golden, about 4 minutes. Stir in tomato paste, cumin, 1/4 teaspoon each salt and black pepper and the chili powder, and sauté for 2 minutes longer. Add broth, 2 cups water, lentils and carrot. Bring to a simmer, then partly cover pot and turn heat to medium-low. Simmer until lentils are soft, about 30 minutes. Taste and add salt if necessary. Using an immersion or regular blender or a food processor, purée half the soup, then add it back to pot. The soup should be somewhat chunky. Reheat soup if necessary, then stir in lemon juice and cilantro. Serve soup drizzled with good olive oil and dusted lightly with chili powder.",
    "source": "Red Lentil Soup Recipe (with Video).pdf",
    "servings": "4",
    "time": "45 minutes"
  },
  {
    "id": "6",
    "name": "Saucy Gochujang Noodles with Chicken",
    "category": "chicken",
    "ingredients": [
      "3 tablespoons soy sauce",
      "2-3 tablespoons gochujang sauce",
      "2 tablespoons tomato paste",
      "2 tablespoons peanut butter",
      "2 tablespoons water",
      "1-2 tablespoons brown sugar",
      "1 tablespoon sesame oil",
      "1 clove minced garlic",
      "1-2 cups broth or water for thinning",
      "1 pound ground chicken",
      "1/2 teaspoon salt",
      "Freshly ground black pepper",
      "2 packets ramen or stir fry noodles",
      "1-2 cups fresh spinach",
      "1/4 cup chives, scallions, cilantro or herbs for topping",
      "1 tablespoon chili oil for finishing",
      "1 tablespoon sesame seeds for finishing"
    ],
    "instructions": "Whisk the sauce ingredients (except the extra broth) in a small bowl or shake together in a jar. It should form a thick sauce. Cook the chicken in a large skillet over medium high heat. Season generously with salt and pepper. Boil the noodles for just a few minutes to soften. Drain and set aside. When the chicken is done, add spinach, cooked noodles, and sauce to the pan, keeping it over medium high heat. Toss to combine; heat until the spinach is wilted. Add extra water or broth to thin the sauce, a little at a time, to get the sauciness that you like. Serve topped with fresh herbs, scallions, chili oil, sesame seeds.",
    "source": "Saucy Gochujang Noodles with Chicken Recipe - Pinch of Yum.pdf",
    "servings": "4-6",
    "time": "30 minutes"
  },
  {
    "id": "7",
    "name": "Braised Chickpeas with Zucchini and Pesto",
    "category": "vegetarian",
    "ingredients": [
      "2 15-ounce cans of chickpeas, drained and rinsed",
      "1 1/2 to 2 cups vegetable broth",
      "4 garlic cloves, thinly sliced",
      "1 large yellow onion, halved and thinly sliced",
      "1/4 teaspoon red pepper flakes",
      "1 1/2 teaspoons kosher salt",
      "1 pound summer squash or zucchini, quartered lengthwise, thinly sliced",
      "1/4 cup olive oil",
      "1/4 cup prepared or storebought basil pesto",
      "8 ounces of burrata or 1 cup fresh ricotta",
      "Grated parmesan cheese, to finish",
      "Sliced sourdough or country bread, grilled or toasted"
    ],
    "instructions": "Place chickpeas and 1 1/2 cups broth in a large braiser or saucepan. Scatter garlic, onion, pepper flakes, salt, and zucchini on top and drizzle olive oil over. No need to stir. Bring to a simmer and cover to cook for 45 minutes total. At the 15-minute mark, remove the lid. At the 30-minute mark, stir ingredients. If liquid is gone or chickpeas are sticking, add remaining 1/2 cup broth. Remove from heat and stir in pesto in dollops. Make divots for the burrata, using your fingers to tear it into chunks before nudging them into the pan. Finish with parmesan and extra pepper flakes. Ladle into low bowls and serve with grilled bread.",
    "source": "SK chickpeas & zucchini.pdf",
    "servings": "4",
    "time": "1 hour"
  },
  {
    "id": "8",
    "name": "Rigatoni with Eggplant Purée",
    "category": "pasta",
    "ingredients": [
      "1 medium eggplant, cut into 1-inch cubes",
      "1 pint (2 cups) cherry tomatoes",
      "3 cloves garlic, peeled",
      "3 tablespoons olive oil",
      "1 teaspoon kosher salt",
      "1 teaspoon freshly ground black pepper",
      "1 teaspoon red pepper flakes (adjust to taste)",
      "1 pound dried rigatoni pasta",
      "1/4 cup torn fresh mint or basil leaves, plus extra for garnish",
      "3 tablespoons olive oil",
      "1/2 cup grated Parmesan or ricotta salata",
      "1/4 cup toasted pine nuts"
    ],
    "instructions": "Heat oven to 400 degrees F. Line a large baking sheet with parchment paper. In a large bowl combine the eggplant, cherry tomatoes, garlic, 3 tablespoons olive oil, salt, pepper, and red pepper flakes. Spread the vegetables out in an even layer on the baking sheet. Roast until the vegetables are tender and the eggplant is golden, about 35 minutes. Meanwhile, bring a large pot of salted water to a boil. Add the pasta and cook until tender but a full minute shy of done, about 8 to 10 minutes. Drain pasta but reserve a cup of the cooking water. Transfer the roasted vegetables to a food processor or blender. Add the torn mint or basil leaves and additional 3 tablespoons olive oil. Blend until almost smooth. Return the pasta to the cooking pot, pour sauce over it and a splash (about 1/3 cup) of cooking water and cook together, tossing so that the pasta is evenly coated, over medium-high heat for 1 to 2 minutes. Transfer pasta and sauce to a serving bowl; garnish with extra herbs, pine nuts and parmesan.",
    "source": "SK rigatoni with eggplant.pdf",
    "servings": "4-6",
    "time": "50 minutes"
  },
  {
    "id": "9",
    "name": "Roasted Carrots with Avocados and Furikake Seeds",
    "category": "side",
    "ingredients": [
      "3 tablespoons sunflower seeds",
      "3 tablespoons pumpkin seeds",
      "3 tablespoons furikake, plus more to taste",
      "3 medium garlic cloves",
      "1 teaspoon kosher salt",
      "1 teaspoon fennel seeds",
      "1 teaspoon coriander seeds",
      "1 teaspoon fresh thyme leaves",
      "1/4 teaspoon freshly ground black pepper",
      "1/4 teaspoon crushed red pepper flakes",
      "1/4 cup plus 2 tablespoons extra-virgin olive oil",
      "1 tablespoon red wine vinegar",
      "1 pound small carrots, scrubbed",
      "2 oranges, halved",
      "2 avocados"
    ],
    "instructions": "Make the furikake seeds: Position a rack in the middle of the oven and preheat to 350F. On a quarter sheet pan, spread the sunflower and pumpkin seeds in a single layer. Toast, stirring occasionally, 8 to 9 minutes, or until lightly toasted and golden. Don't let the seeds brown too much. Transfer to a small bowl, stir in the furikake, and set aside. Leave the oven on for the carrots. Make the citrus carrots: Line a half sheet pan with parchment paper. In a mini food processor, combine the garlic, salt, fennel, coriander, thyme, black pepper, and pepper flakes. Pulse until roughly chopped, then add 1/4 cup of the oil and the vinegar and process until the marinade is uniform. If you don't have a mini food processor, finely chop the aromatics until almost uniform, then whisk together with the oil and vinegar in a small bowl.",
    "source": "Hot Sheet Recipes.pdf",
    "servings": "4",
    "time": "45 minutes"
  },
  {
    "id": "10",
    "name": "Spiced Yogurt Chicken with Chickpeas and Eggplant",
    "category": "chicken",
    "ingredients": [
      "3/4 cup plain whole-milk yogurt",
      "1/4 cup almond flour",
      "4 garlic cloves, finely chopped",
      "3 tablespoons extra-virgin olive oil",
      "1 tablespoon plus 1 teaspoon kosher salt",
      "1 teaspoon ground cumin",
      "1/2 teaspoon ground coriander",
      "1/2 teaspoon ground turmeric",
      "1/4 teaspoon ground cinnamon",
      "Several grinds of black pepper",
      "8 pieces bone-in, skin-on chicken legs (about 3 1/2 to 4 kg total)",
      "12 ounces small eggplant, cut into 1-inch pieces",
      "3 shallots, halved lengthwise",
      "One 15-ounce can chickpeas, drained and rinsed",
      "Fresh cilantro leaves for serving"
    ],
    "instructions": "In a large bowl, mix together the yogurt, almond flour, garlic, olive oil, salt, cumin, coriander, turmeric, cinnamon, and black pepper. Add the chicken and rub the mixture evenly over it, carefully getting it under the skin without removing it. Cover and refrigerate for at least 2 hours and up to overnight. When ready to roast, position a rack in the middle of the oven and preheat to 425F. Place the eggplant in a colander and sprinkle with the 1 teaspoon salt. Toss to coat and set aside to drain for 30 minutes. Pat dry with paper towels, absorbing any moisture. On a half-sheet pan, toss the eggplant and chickpeas with the remaining 3 tablespoons oil. Lightly season with salt and pepper. Scoop the chicken out of the marinade and nestle, skin side up, among the eggplant and chickpeas, keeping everything in an even layer. It will be snug. Drizzle any remaining yogurt marinade over the chicken skin. Roast for about 1 hour, stirring the eggplant and chickpea halves through, or until the chicken is deeply golden brown and cooked through and the eggplant is completely softened and browning at the edges. Remove from the oven, garnish with cilantro, and serve.",
    "source": "Hot Sheet Recipes.pdf",
    "servings": "4-6",
    "time": "1 hour 30 minutes"
  },
  {
    "id": "11",
    "name": "Chicken Legs with Prunes, Pancetta, and Potatoes",
    "category": "chicken",
    "ingredients": [
      "5 tablespoons extra-virgin olive oil, divided",
      "2 tablespoons herbes de Provence",
      "1 tablespoon dark brown sugar",
      "1 tablespoon sherry vinegar or red wine vinegar",
      "2 teaspoons kosher salt, plus more as needed",
      "Freshly ground black pepper",
      "4 bone-in, skin-on chicken legs (about 3 1/2 to 4 lbs total)",
      "12 ounces small potatoes, such as fingerling or creamer potatoes, halved or quartered if large",
      "3 shallots, halved lengthwise and cut into 1/2-inch slices",
      "4 ounces pancetta cubes (or coarsely chopped bacon)",
      "1 cup prunes",
      "1/4 cup boiling water"
    ],
    "instructions": "Position a rack in the middle of the oven and preheat to 425F. In a medium bowl, combine 3 tablespoons of the oil, the herbes de Provence, brown sugar, sherry vinegar, salt, and lots of pepper. Add the chicken legs and mix to coat all over. On a half-sheet pan, toss the potatoes, shallots, and pancetta with the remaining 2 tablespoons oil. Season lightly with salt and pepper and mix well to combine. Make room for the chicken legs and nestle them, skin side up, among the other ingredients on the sheet pan. Drizzle any remaining marinade over the chicken. Roast for 30 minutes. Meanwhile, place the prunes in a heatproof medium bowl and pour the boiling water over them. Set aside, stirring from time to time. After 30 minutes, stir the shallots and potatoes and add the prunes, scattering them around the chicken and potatoes. Drizzle the prune soaking liquid over everything. Roast for 15 to 20 minutes more, or until the chicken is cooked through, the skin is browned, and the potatoes and shallots are tender and golden brown. Serve on a large platter or divide among four plates.",
    "source": "Hot Sheet Recipes.pdf",
    "servings": "4",
    "time": "1 hour"
  },
  {
    "id": "12",
    "name": "Quick Rigatoni Bolognese",
    "category": "pasta",
    "ingredients": [
      "2 tablespoons kosher salt",
      "16 ounces rigatoni, or pasta of choice",
      "1/4 cup extra-virgin olive oil",
      "1 medium yellow onion, finely diced",
      "1 carrot, peeled and finely diced",
      "2 garlic cloves, finely chopped",
      "1 1/4 teaspoons kosher salt",
      "1/2 teaspoon freshly ground black pepper",
      "1/2 pound ground beef, 85% lean",
      "1/2 pound ground pork",
      "1 (6-ounce) can tomato paste",
      "1 tablespoon balsamic vinegar",
      "1 (28-ounce) can crushed San Marzano tomatoes, undrained",
      "1/2 cup half-and-half",
      "1/4 teaspoon red chile flakes",
      "Grated Parmesan cheese, for serving",
      "Finely chopped fresh parsley or basil, optional"
    ],
    "instructions": "Bring a large pot of water and the salt to a boil. Add the pasta to the boiling water and cook to al dente according to the package directions. Meanwhile, heat the olive oil in a Dutch oven or large pot over medium-high heat. Add the onion and carrot and cook, stirring occasionally, until softened, about 2 minutes. Add the garlic, salt, and pepper, and cook until the garlic is softened and fragrant, 30 seconds to 1 minute. Add the beef and pork and use a wooden spoon to break up and flatten the meat. Let it cook, undisturbed, until browned, about 2 minutes. Reduce the heat to medium, stir the meat to break it up, and add the tomato paste and vinegar. Stir to evenly coat the meat and cook, stirring occasionally, until the tomato paste darkens and the sugars caramelize, 1 to 2 minutes. Add the crushed tomatoes and juices, half-and-half, and chile flakes, stir to combine, and continue to cook until the pasta is ready. When the pasta is done, scoop out 1/2 cup of the pasta water and reserve. Drain the pasta and stir it into the sauce. Vigorously stir in the reserved pasta water. Transfer to serving dishes and top with Parmesan. Garnish with fresh parsley or basil if desired.",
    "source": "Brocc first 10 pages.pdf",
    "servings": "6-8",
    "time": "30 minutes"
  },
  {
    "id": "13",
    "name": "Date Night Chicken in Creamy Mushroom Sauce",
    "category": "chicken",
    "ingredients": [
      "2 boneless, skinless chicken breasts (about 1 1/2 pounds)",
      "1 1/2 teaspoons kosher salt",
      "1/2 teaspoon freshly ground black pepper",
      "2 tablespoons extra-virgin olive oil",
      "5 tablespoons unsalted butter",
      "3 large shallots, thinly sliced",
      "4 garlic cloves, finely chopped",
      "12 ounces baby bella (cremini) mushrooms, thinly sliced",
      "3 tablespoons fresh thyme leaves",
      "1/2 tablespoon balsamic vinegar",
      "2 tablespoons all-purpose flour",
      "1 1/2 cups chicken broth",
      "1/2 cup half-and-half",
      "1/4 cup grated Parmesan"
    ],
    "instructions": "Season the chicken breasts with salt and pepper. Heat the olive oil in a large skillet over medium-high heat. Add the chicken and cook until golden brown and cooked through, about 6-8 minutes per side. Transfer to a plate. Add the butter to the skillet. Once melted, add the shallots and cook until softened, about 3 minutes. Add the garlic and mushrooms and cook, stirring occasionally, until the mushrooms are golden brown and tender, about 8 minutes. Add the thyme and balsamic vinegar and cook for 1 minute. Sprinkle the flour over the mushrooms and stir to combine. Cook for 1 minute. Gradually add the chicken broth, stirring constantly. Add the half-and-half and bring to a simmer. Cook until the sauce thickens, about 3-4 minutes. Stir in the Parmesan. Return the chicken to the skillet and spoon the sauce over it. Serve immediately.",
    "source": "Brocc first 10 pages.pdf",
    "servings": "2",
    "time": "30 minutes"
  },
  {
    "id": "14",
    "name": "Crispy Italian Sausage & Broccolini Orecchiette",
    "category": "pasta",
    "ingredients": [
      "Fresh pasta: 1 recipe Simple Semolina Dough, shaped into orecchiette, OR 14 ounces dried orecchiette or cavatelli",
      "1 bunch (about 10 ounces) broccolini",
      "1/4 cup extra-virgin olive oil",
      "1 shallot, finely chopped",
      "3 garlic cloves, finely chopped",
      "3 links (12 to 14 ounces) sweet or hot Italian sausage, casings removed",
      "1/4 cup chopped flat leaf parsley",
      "1/2 teaspoon kosher salt",
      "Freshly ground black pepper",
      "2 tablespoons unsalted butter",
      "1/3 cup grated Parmigiano-Reggiano, plus more for topping",
      "1/4 to 1/2 teaspoon red pepper flakes"
    ],
    "instructions": "Bring two large pots of lightly salted water to a boil. Trim the broccolini and slice the stems into 1/4-inch pieces, leaving at least 1 inch of the stem on every floret. Add the broccolini stems and florets to one of the pots of boiling water and blanch until crisp-tender, 2 to 3 minutes. Drain in a colander and set aside. In a large frying pan over medium-low heat, warm the olive oil. Add the shallot and garlic and sauté for a couple of minutes. Add the sausage, turn the heat to medium-high, and cook, breaking it up into small pieces with a wooden spoon, until it's deliciously brown and crisp, 12 to 15 minutes. Then add the broccolini and parsley, season with the salt and pepper, and stir to combine. Keep warm. Add the orecchiette to the second pot of boiling water and cook for 3 to 4 minutes, or according to package instructions if using store-bought. Using a large spider or slotted spoon, transfer the pasta into the sausage mixture along with the butter, Parmigiano, and 1/2 cup of the pasta water and toss to combine. Serve the pasta topped with more Parmigiano and the red pepper flakes.",
    "source": "simple pasta.pdf",
    "servings": "4",
    "time": "35 minutes"
  },
  {
    "id": "15",
    "name": "Cavatelli with Sausage, Peppers & Oregano",
    "category": "pasta",
    "ingredients": [
      "14 ounces cavatelli pasta",
      "1/4 cup extra-virgin olive oil",
      "1 pound Italian sausage, casings removed",
      "1 onion, finely diced",
      "1 bay leaf",
      "1 teaspoon kosher salt",
      "1/2 teaspoon freshly ground black pepper",
      "4 garlic cloves, finely chopped",
      "2 tablespoons tomato paste",
      "1 cup chicken stock",
      "3 bell peppers (mix of red, yellow, green), seeded and diced",
      "1 tablespoon finely chopped fresh oregano",
      "2 tablespoons sherry vinegar",
      "1/2 cup heavy cream",
      "Finely grated Parmigiano-Reggiano for sprinkling",
      "Red pepper flakes for sprinkling"
    ],
    "instructions": "In a large heavy-bottomed frying pan or Dutch oven over medium heat, warm the olive oil. Add the sausage, onion, and bay leaf; season with the salt and pepper; and cook for 10 minutes, breaking the meat into small pieces with a wooden spoon. Add the garlic to the pan and sauté for 1 minute, then add the tomato paste and continue to cook for another minute or two. Add the chicken stock and bell peppers. Cook, stirring occasionally, until the peppers are soft and the liquid has reduced, about 15-20 minutes. Meanwhile, cook the cavatelli according to package directions. Stir in the oregano, sherry vinegar, and heavy cream. Add the cooked pasta and toss to coat. Serve topped with Parmigiano and red pepper flakes.",
    "source": "simple pasta.pdf",
    "servings": "4-6",
    "time": "40 minutes"
  },
  {
    "id": "16",
    "name": "Ginger Garlic Chicken Noodle Soup",
    "category": "soup",
    "ingredients": [
      "2 pounds boneless, skinless chicken thighs",
      "4 garlic cloves, thinly sliced",
      "1-inch piece ginger, peeled, finely chopped",
      "1 bundle (6 to 8 ounces) scallions, thinly sliced, whites and greens separated",
      "4 teaspoons kosher salt",
      "Freshly ground white or black pepper",
      "10 cups water",
      "8 ounces dried curly or other dried ramen-style noodles",
      "1/2 cup sliced carrot, cut into thin matchsticks",
      "1/4 cup black rice vinegar",
      "1/4 cup soy sauce",
      "2 tablespoons toasted sesame oil",
      "Crispy chili oil, to taste"
    ],
    "instructions": "Bring the chicken, garlic, ginger, scallion whites, salt, pepper, and water to a boil in a 4-to-5-quart pot. Reduce the heat to medium-low, and simmer, uncovered, stirring occasionally, until the chicken is very tender and cooked through, about 15 minutes. While the soup simmers, whisk together the vinegar, soy sauce, and sesame oil in a bowl, and add as much chili crisp as your heart desires. Add the noodles and carrots to the pot and cook until the noodles are tender, about 3-4 minutes. Remove from heat. Shred the chicken with two forks. Ladle soup into bowls. Drizzle with the soy-vinegar mixture and top with reserved scallion greens.",
    "source": "smitten kitchen keepers recipes.pdf",
    "servings": "4-6",
    "time": "45 minutes"
  },
  {
    "id": "17",
    "name": "Simple Black Bean Chili",
    "category": "vegetarian",
    "ingredients": [
      "1 medium poblano, halved, seeds removed",
      "1 jalapeño or habanero chili, halved, seeds removed",
      "1 medium white onion, trimmed, cut into 8 wedges",
      "2 large garlic cloves, unpeeled",
      "2 tablespoons vegetable oil, divided",
      "1 1/2 teaspoons kosher salt",
      "1 teaspoon chipotle chili powder",
      "2 teaspoons ground cumin",
      "1 teaspoon dried oregano",
      "One 14.5-ounce can crushed tomatoes (fire-roasted if available)",
      "Two 15.5-ounce cans black beans, drained and rinsed",
      "Water, if needed",
      "Handful of chopped fresh cilantro leaves",
      "Juice of 1/2 lime",
      "Sour cream, sliced scallions, avocado, pickled jalapeños, for garnishes"
    ],
    "instructions": "Heat your broiler. Arrange the poblano, jalapeño, onion wedges, and garlic on a sheet pan. Drizzle with 1 tablespoon oil. Broil until charred in spots and softened, turning as needed, about 10-15 minutes. Let cool slightly, then peel the garlic. Transfer everything to a blender. Add the salt, chipotle powder, cumin, oregano, and crushed tomatoes. Blend until smooth. In a large pot or Dutch oven, heat the remaining tablespoon of oil over medium heat. Add the blended sauce and cook, stirring, for 5 minutes. Add the black beans and 1/2 cup water if needed. Simmer for 15 minutes, stirring occasionally. Stir in cilantro and lime juice. Serve in bowls topped with sour cream, scallions, avocado, and pickled jalapeños.",
    "source": "smitten kitchen.pdf",
    "servings": "4-6",
    "time": "45 minutes"
  },
  {
    "id": "18",
    "name": "Braised Eggplant with Parm Vibes",
    "category": "vegetarian",
    "ingredients": [
      "3 medium Japanese eggplants (about 1 1/2 pounds total), tops trimmed and halved lengthwise",
      "Kosher salt",
      "5 tablespoons extra-virgin olive oil",
      "4 garlic cloves, thinly sliced",
      "1 teaspoon chili flakes",
      "1 pint cherry tomatoes (12 ounces)",
      "1/2 cup water",
      "4 ounces part-skim mozzarella cheese, torn into 1/4-inch chunks",
      "1/4 cup coarsely grated parmesan cheese",
      "1/4 cup lightly packed fresh basil leaves",
      "Crusty bread, buttered pasta, or polenta to serve"
    ],
    "instructions": "Position a rack in the center of the oven and set the broiler to high. Heat a large cast-iron or broilerproof stainless steel skillet over medium-high heat until barely smoking. While the skillet heats, season the cut sides of the eggplant with salt. Add 3 tablespoons of the olive oil to the pan and swirl to coat. Quickly arrange the eggplant in the pan cut-side down. Use a fish spatula to firmly press the eggplant pieces down. Cook until lightly charred and starting to soften, about 5 minutes. Remove the skillet from the heat and transfer the eggplant to a plate. Add the remaining 2 tablespoons olive oil, the garlic, and chili flakes to the skillet. Cook over medium heat, stirring constantly, until fragrant, about 1 minute. Add the cherry tomatoes and water and cook until the tomatoes are softened, pressing them with the back of the spatula to burst them all, 4 to 6 minutes. Season with salt. Return the eggplant to the skillet and cook until tender and the sauce has reduced and thickened slightly, about 5 minutes. Taste the sauce and add salt if needed. Dot the pan with the torn mozzarella and sprinkle with the parmesan. Transfer to the oven and broil until the cheese melts and browns, about 1 minute. Tear the basil leaves and scatter on top. Serve immediately with crusty bread, buttered pasta, or polenta.",
    "source": "Sohla Recipes.pdf",
    "servings": "4",
    "time": "30 minutes"
  },
  {
    "id": "19",
    "name": "Zucchini Spaghetti",
    "category": "pasta",
    "ingredients": [
      "1/4 cup extra-virgin olive oil",
      "10 garlic cloves, thinly sliced",
      "8 medium zucchini (about 3 pounds), halved lengthwise and thinly sliced crosswise",
      "Kosher salt",
      "1 cup water",
      "2 teaspoons chili flakes",
      "1 pound spaghetti",
      "1/2 cup lightly packed fresh mint leaves, plus more for garnish",
      "1 1/2 cups coarsely grated Pecorino Romano cheese (about 6 ounces), plus more for garnish"
    ],
    "instructions": "In a medium Dutch oven, warm the olive oil over medium-high heat until fragrant and shimmery. Add the garlic and cook, stirring frequently, until the garlic is fragrant and browned along the edges, 2 to 4 minutes. Add the zucchini, a large pinch of salt, and the water. Cover and cook, stirring occasionally until the zucchini collapses and grows wilted and soft, about 8 minutes. Uncover and cook until the water has evaporated and the zucchini has cooked down to a thick paste and has started to brown, 25 to 30 minutes. Meanwhile, cook the spaghetti in salted water until barely tender with a bite at the core. Reserve 2 cups pasta water, then drain. Add the drained pasta to the zucchini with 1 cup of the reserved pasta water, the chili flakes, mint, and cheese. Toss vigorously over medium heat until the pasta is coated and the sauce is creamy, adding more pasta water as needed. Serve topped with more mint and cheese.",
    "source": "Sohla Recipes.pdf",
    "servings": "6-8",
    "time": "50 minutes"
  },
  {
    "id": "20",
    "name": "Brioche Dinner Rolls",
    "category": "bread",
    "ingredients": [
      "4 cups all-purpose flour",
      "1 packet Fleischmann's RapidRise Instant Yeast",
      "1/4 cup granulated sugar",
      "1 1/2 teaspoons salt",
      "1 cup milk, warmed to 120 to 130F",
      "2 large eggs + 1 yolk",
      "1/2 cup unsalted butter, room temperature",
      "1 egg (for egg wash)"
    ],
    "instructions": "In the bowl of a stand mixer fitted with the paddle attachment, combine 3 cups of the flour, sugar, salt, and yeast. Make a well in the center and add the milk and eggs. Beat on medium high speed for 3 minutes. Change out the paddle for the dough hook and add the softened butter a little bit at a time, mixing well in between each addition. Add 1 more cup of flour and knead for 10 minutes in the mixer until the dough starts to smooth out. The dough will still be sticky but should pull away from the sides of the mixing bowl. Place in a greased bowl, cover with a dish cloth or plastic wrap and set aside to rise in a warm place for 1 hour. Once the dough has risen, turn it out onto a well floured surface and divide into 12 equal pieces. Roll each piece into a smooth ball and place in a greased 9 x 13 pan a few inches apart, 3 across and 4 down. Cover the pan and let rise for an hour. While the dough rises, preheat the oven to 350F and prepare your egg wash. Beat 1 egg with 1 teaspoon of water until homogenous. After the dough has risen, brush the rolls generously with the egg wash. Bake for 20 to 25 minutes or until golden brown and hollow sounding when tapped. Allow to cool before serving.",
    "source": "Brioche Dinner Rolls - Broma Bakery.pdf",
    "servings": "12 rolls",
    "time": "2 hours 45 minutes"
  },
  {
    "id": "21",
    "name": "Mandarin Orange Cranberry Sauce",
    "category": "sauce",
    "ingredients": [
      "24 ounces cranberries, fresh or frozen",
      "0.5 cup white granulated sugar, plus more as needed",
      "0.5 cup light brown sugar",
      "Juice and zest of 1 mandarin orange",
      "2 knobs of ginger, grated",
      "1 cup water, adjust depending on preferred consistency",
      "Pinch of salt"
    ],
    "instructions": "In a medium saucepan, add in your cranberries and toss with white sugar, brown sugar, orange zest and juice, grated ginger, water, and a pinch of salt. Stir to make sure everything is mixed and incorporated. Bring to a boil on medium-high heat, then bring to a gentle simmer on medium-low heat until the cranberries pop and create your sauce, about 15 minutes. You can use the back of your spoon to help pop the cranberries. You can adjust it with more water if you want a thinner sauce. If it's too tart, adjust with more sugar.",
    "source": "Easy Mandarin Orange Cranberry Sauce Recipe (in 20 Minutes) _ Lindsey Eats.pdf",
    "servings": "12",
    "time": "20 minutes"
  },
  {
    "id": "22",
    "name": "Tandem-Roast Chicken",
    "category": "chicken",
    "ingredients": [
      "2 tablespoons kosher salt",
      "2 tablespoons dried oregano",
      "1 teaspoon cayenne",
      "2 (3.5 to 4-pound) whole chickens",
      "Extra-virgin olive oil, for drizzling"
    ],
    "instructions": "Preheat the oven to 425°F. In a small bowl, mix salt, oregano, and cayenne. Fit a rimmed baking sheet with a wire rack, then place chickens on top. Season all sides and inside the cavities with spice mix, then drizzle with olive oil and rub it in evenly. Place the baking sheet in the oven and carefully pour in enough water to cover entire surface (about 1.5 cups should do it; this will prevent drippings from burning during roasting and throws a little bit of steam into the oven). Roast until the skin is browned and crisp and a thermometer inserted into the thickest part of the breast registers 155°F, about 55 minutes. Let sit 20 to 30 minutes before carving.",
    "source": "carla lalli music's recipes.pdf",
    "servings": "6-8",
    "time": "1 hour 30 minutes"
  },
  {
    "id": "23",
    "name": "Gingery Ground Beef with Lime and Herb",
    "category": "beef",
    "ingredients": [
      "2-inch piece ginger, peeled",
      "1 shallot, finely diced",
      "2 limes, juiced",
      "1/4 cup soy sauce",
      "2 tablespoons sriracha",
      "1 tablespoon fish sauce",
      "1 tablespoon vegetable oil",
      "1.5 pounds ground beef chuck",
      "Kosher salt",
      "4 garlic cloves, thinly sliced",
      "1 cup thinly sliced cilantro",
      "Cooked rice for serving (optional)",
      "Lettuce cups for serving (optional)"
    ],
    "instructions": "Prep all your ingredients before you cook. Peel the ginger and cut it into matchsticks. Thinly slice the garlic. Finely dice the shallot and put it in a small bowl, then add the juice of both limes. Add the soy sauce, sriracha, and fish sauce and stir to combine. Heat a large cast-iron or other heavy-bottomed skillet over high heat for 2 minutes. Add the oil and tilt to coat. Add the ground beef, season with salt, and immediately use a wooden spoon or metal spatula to smash the meat, flattening and breaking it into pieces. Cook, undisturbed, until the underside is browned and the beef is still juicy on top, 5 minutes. Add the ginger and garlic, toss to combine, and cook, stirring occasionally, until the ginger and garlic are golden and starting to crisp, 2 minutes more. Add the lime mixture and cook, stirring, until the sauce has reduced to a light glaze, about 3 minutes. Turn off the heat and toss in the cilantro. Serve with rice and/or lettuce cups for wrapping around the meat, if desired.",
    "source": "carla lalli music's recipes.pdf",
    "servings": "4",
    "time": "25 minutes"
  },
  {
    "id": "24",
    "name": "Extremely Green Grain Salad",
    "category": "salad",
    "ingredients": [
      "2 cups farro",
      "1 tablespoon kosher salt, plus more for seasoning",
      "Freshly ground black pepper",
      "1 bunch broccoli (2 stalks, about 1 pound)",
      "1/2 cup extra-virgin olive oil, plus more for drizzling",
      "1 bunch scallions (5.5 ounces)",
      "1 small bunch basil (about 2 ounces)",
      "1 small bunch parsley (about 2 ounces)",
      "2-inch piece fresh ginger",
      "1 cup raw cashews",
      "1 lime",
      "1/2 cup golden raisins"
    ],
    "instructions": "Rinse farro, then place in a medium pot and cover with 6 cups water. Add 1 tablespoon salt and a drizzle of oil and bring to a boil over medium-high. Lower the heat and simmer, stirring occasionally, until the grains are tender but still have a little chew, 35 to 45 minutes. Drain and spread out on a rimmed baking sheet to cool, tossing occasionally. While farro cooks, trim woody ends of the broccoli stems, then peel the stems. Roughly chop the broccoli stems and florets. Transfer broccoli to a food processor and pulse until finely chopped. Transfer to a medium bowl. Bring a small pot of water to a boil, season with salt. Trim scallions, then cut into 3-inch lengths. Boil scallions until softened and tender, 3 minutes. Use a slotted spoon to transfer them to a plate. Roughly chop the basil and parsley, then boil until wilted and tender, 2 minutes. Add herbs to plate with scallions. When cool enough to handle, squeeze excess liquid from scallions and herbs. Finely grate the ginger, then place it in a small strainer set over a small bowl and press with the back of a spoon to release the ginger juice. Pulse 3/4 cup cashews in food processor until finely chopped, then add the scallions and herbs. With motor running, drizzle in 1/2 cup oil. Cut lime in half and squeeze in juice. Add the ginger juice, then process the dressing until emulsified. Taste and season with salt and pepper. Combine the grains, broccoli, and dressing in a large bowl. Roughly chop raisins and remaining cashews; add to bowl. Toss to combine.",
    "source": "carla lalli music's recipes.pdf",
    "servings": "6",
    "time": "1 hour"
  },
  {
    "id": "25",
    "name": "Winter Squash with Crispy Sage and Honey",
    "category": "side",
    "ingredients": [
      "1 kabocha or 2 delicata squash (acorn will work too, or a mix), cut into 1/2-inch-thick slices, seeds removed if desired",
      "15 fresh sage leaves",
      "2 tablespoons extra-virgin olive oil",
      "2 tablespoons honey",
      "2 teaspoons kosher salt",
      "1/2 teaspoon freshly ground black pepper"
    ],
    "instructions": "Preheat the oven to 425°F. On a baking sheet, toss the squash and sage with the olive oil, honey, salt, and pepper. Roast until the squash is tender and golden, 20 to 25 minutes, flipping once about halfway through. Serve.",
    "source": "squash.pdf",
    "servings": "4",
    "time": "25 minutes"
  },
  {
    "id": "26",
    "name": "Buttered Rice with Shrimpy-Kimchi Tomato Sauce",
    "category": "seafood",
    "ingredients": [
      "1 cup short-grain white rice",
      "4 tablespoons (3 ounces) unsalted butter",
      "1 cup cabbage kimchi, roughly chopped",
      "1 pint cherry tomatoes (any color)",
      "1 pound large shrimp, peeled, deveined, and cut into 2-inch pieces",
      "Kosher salt",
      "1 small bunch basil"
    ],
    "instructions": "Place the rice in a fine-mesh strainer and rinse under cold running water until the water mostly runs clear, about 1 minute. Drain well, then combine the rice and 1.5 cups water in a small saucepan and place it over medium-high heat. As soon as the liquid is at a simmer, reduce the heat to medium-low, cover, and cook until the rice is tender and the water has been absorbed, 18 minutes. Meanwhile, melt butter in a medium saucepan over medium heat until it foams, then add the kimchi and any of its juices and cook, stirring occasionally, until the liquid is simmering, 3 minutes. Add the tomatoes and stir to coat. Simmer gently, stirring occasionally, until the tomato skins are wrinkled and tomatoes are starting to collapse, 3 to 4 minutes. Use the back of a wooden spoon to press gently on the tomatoes so they split and release their juices and simmer until the sauce is thickened, 3 minutes more. Add the shrimp to the sauce, lower the heat, and cook very gently, stirring occasionally, just until opaque, 5 minutes. Don't boil the shrimp—cooking them slowly keeps them tender and juicy! Taste the sauce and season with salt if needed. Thinly slice the basil. Fluff the rice with a fork, then gently mix in the herbs. Serve the rice with the shrimp sauce spooned over.",
    "source": "carla lalli music's recipes.pdf",
    "servings": "4",
    "time": "30 minutes"
  },
  {
    "id": "28",
    "name": "Sheet Pan Chicken Fajitas",
    "category": "chicken",
    "ingredients": [
      "1.5 pounds boneless skinless chicken breasts, sliced into strips",
      "3 bell peppers (mixed colors), sliced",
      "1 large onion, sliced",
      "3 tablespoons olive oil",
      "2 tablespoons lime juice",
      "2 teaspoons chili powder",
      "1 teaspoon ground cumin",
      "1 teaspoon garlic powder",
      "1 teaspoon paprika",
      "1/2 teaspoon salt",
      "Flour tortillas",
      "Toppings: sour cream, guacamole, salsa, cheese, cilantro"
    ],
    "instructions": "Preheat oven to 400F. In a large bowl, whisk together olive oil, lime juice, chili powder, cumin, garlic powder, paprika, and salt. Add the chicken strips, peppers, and onion. Toss to coat everything evenly. Spread in a single layer on a large sheet pan. Bake for 20-25 minutes, stirring halfway through, until chicken is cooked through and vegetables are tender. Serve with warm tortillas and your favorite toppings.",
    "source": "Hot Sheet Recipes.pdf",
    "servings": "4-6",
    "time": "35 minutes"
  },
  {
    "id": "29",
    "name": "One-Pot Creamy Tuscan Chicken",
    "category": "chicken",
    "ingredients": [
      "4 boneless skinless chicken breasts",
      "2 teaspoons Italian seasoning",
      "1 teaspoon garlic powder",
      "Salt and pepper",
      "2 tablespoons olive oil",
      "4 garlic cloves, minced",
      "1 cup chicken broth",
      "1 cup heavy cream",
      "1/2 cup sun-dried tomatoes, chopped",
      "3 cups fresh spinach",
      "1/2 cup grated Parmesan cheese"
    ],
    "instructions": "Season chicken breasts with Italian seasoning, garlic powder, salt, and pepper. Heat olive oil in a large skillet over medium-high heat. Add chicken and cook for 5-6 minutes per side until golden and cooked through. Transfer to a plate. In the same skillet, add minced garlic and cook for 30 seconds. Add chicken broth and scrape up any browned bits. Add heavy cream and sun-dried tomatoes. Bring to a simmer. Add spinach and cook until wilted. Stir in Parmesan cheese. Return chicken to the skillet and spoon sauce over it. Simmer for 2-3 minutes. Serve over pasta, rice, or with crusty bread.",
    "source": "Brocc first 10 pages.pdf",
    "servings": "4",
    "time": "30 minutes"
  },
  {
    "id": "30",
    "name": "Beef and Mushroom Stroganoff",
    "category": "beef",
    "ingredients": [
      "1.5 pounds beef sirloin, sliced into thin strips",
      "Salt and pepper",
      "3 tablespoons butter, divided",
      "1 tablespoon olive oil",
      "1 large onion, sliced",
      "8 ounces cremini mushrooms, sliced",
      "3 garlic cloves, minced",
      "1 tablespoon flour",
      "1 cup beef broth",
      "1 tablespoon Worcestershire sauce",
      "1 cup sour cream",
      "Egg noodles for serving",
      "Fresh parsley for garnish"
    ],
    "instructions": "Season beef strips with salt and pepper. Heat 1 tablespoon butter and olive oil in a large skillet over high heat. Add beef and cook quickly until browned, about 2 minutes. Transfer to a plate. Reduce heat to medium. Add remaining butter, onion, and mushrooms. Cook until softened and browned, about 8 minutes. Add garlic and cook for 1 minute. Sprinkle flour over the vegetables and stir to coat. Add beef broth and Worcestershire sauce, scraping up any browned bits. Bring to a simmer and cook until slightly thickened, about 3 minutes. Remove from heat and stir in sour cream. Return beef to the skillet and toss to combine. Serve over egg noodles, garnished with parsley.",
    "source": "smitten kitchen keepers recipes.pdf",
    "servings": "4-6",
    "time": "35 minutes"
  },
  {
    "id": "31",
    "name": "Basil Almond Pesto",
    "category": "sauce",
    "ingredients": [
      "3 cups packed fresh basil leaves",
      "1/2 cup roasted, unsalted almonds",
      "1/2 cup freshly grated Parmesan or pecorino cheese",
      "4 garlic cloves",
      "1/2 teaspoon kosher salt, plus more as needed",
      "1/4 teaspoon freshly ground black pepper",
      "1/4 teaspoon red pepper flakes",
      "1/2 cup extra-virgin olive oil"
    ],
    "instructions": "In a food processor or blender, combine the basil, almonds, Parmesan, garlic, salt, black pepper, and pepper flakes. Pulse 8 to 10 times to break down the ingredients, stopping to scrape down the sides as needed. Slowly drizzle the olive oil into the food processor as you pulse about 4 more times, incorporating it bit by bit into the pesto. Your pesto should look well incorporated and stunningly green. Taste the pesto for seasoning, then transfer to an airtight container and store refrigerated for up to a week.",
    "source": "Basil Almond Pesto.pdf",
    "servings": "1.5 cups",
    "time": "10 minutes"
  },
  {
    "id": "32",
    "name": "Garlicky Oregano Dressing",
    "category": "sauce",
    "ingredients": [
      "1/2 cup extra-virgin olive oil",
      "6 garlic cloves",
      "3 tablespoons red wine vinegar",
      "2 tablespoons spicy brown mustard",
      "2 tablespoons dried oregano",
      "1/2 teaspoon kosher salt",
      "1/4 teaspoon freshly ground black pepper",
      "1/4 teaspoon red pepper flakes"
    ],
    "instructions": "In a blender or food processor, combine the olive oil, garlic, vinegar, mustard, oregano, salt, black pepper, and pepper flakes. Blend on high until well combined, about 30 seconds. Taste for seasoning. Transfer to an airtight container and store refrigerated for up to 1 week.",
    "source": "Basil Almond Pesto.pdf",
    "servings": "3/4 cup",
    "time": "5 minutes"
  },
  {
    "id": "33",
    "name": "Garlicky Citrus Dressing",
    "category": "sauce",
    "ingredients": [
      "1/2 cup extra-virgin olive oil",
      "6 garlic cloves",
      "3 tablespoons fresh lemon juice",
      "2 tablespoons spicy brown mustard",
      "1/2 teaspoon kosher salt",
      "1/4 teaspoon freshly ground black pepper",
      "1/4 teaspoon red pepper flakes"
    ],
    "instructions": "In a blender or food processor, combine the olive oil, garlic, lemon juice, mustard, salt, black pepper, and pepper flakes. Blend on high until well combined, about 30 seconds. Taste for seasoning. Transfer to an airtight container and store refrigerated for up to 1 week.",
    "source": "Basil Almond Pesto.pdf",
    "servings": "3/4 cup",
    "time": "5 minutes"
  },
  {
    "id": "34",
    "name": "Deep Green Pasta",
    "category": "pasta",
    "ingredients": [
      "9 oz lacinato kale",
      "2-3 cloves of garlic, peeled",
      "7 oz spinach",
      "14 oz rigatoni",
      "7 tbsp olive oil",
      "1 unwaxed lemon",
      "Ricotta, Parmesan or Pecorino, for serving (optional)"
    ],
    "instructions": "Get a large pot of water on to a rolling boil and season well with salt. Add the lacinato kale along with the garlic cloves and simmer for about 5 minutes. Then add the spinach, and when it has wilted, keeping the pot of water at a rolling boil, lift the greens and garlic into a colander. Run the greens under cold water and allow to drain. Add the pasta into the pot of water. When the greens are drained, transfer to a high-speed blender, pour in the olive oil, grate in the zest of the lemon and blitz into a very smooth purée, adding a splash of the cooking water to loosen it if needed. Taste and adjust the seasoning. Cook the pasta until al dente, then take a mug and collect a full cup of the starchy water before straining the pasta. Pour the pasta back into the hot pot and add a few big dollops of the sauce—be generous. Add a good splash of the pasta water and really mix well, beating it around the pot to form a thick sauce that envelops the pasta in a deep green blanket. Serve immediately, with a squeeze of lemon, some ricotta, Parmesan or Pecorino, if you like, and a generous drizzle of olive oil.",
    "source": "DEEP GREEN PASTA.pdf",
    "servings": "4",
    "time": "25 minutes"
  },
  {
    "id": "35",
    "name": "Zucchini Pasta with Mascarpone, Basil & Lemon",
    "category": "pasta",
    "ingredients": [
      "2.5 lbs zucchini (ideally a few different colors)",
      "5 tbsp olive oil",
      "4 large cloves of garlic, finely sliced",
      "Pinch of red pepper flakes",
      "14 oz pasta (cavatelli, penne, or linguine)",
      "1 large unwaxed lemon",
      "3 tbsp mascarpone",
      "A large bunch of fresh basil, leaves picked",
      "A knob of butter, about 2 tbsp"
    ],
    "instructions": "Bring a large pot of well-seasoned water to a boil for the pasta. Slice the zucchinis into rounds about as thick as your little finger, cutting any large zucchinis in half lengthwise first. Heat the olive oil in a wide pot and add the zucchinis. Season well with salt to draw out the moisture and fry for 5 minutes to get things going, before adding the garlic and red pepper flakes. The key here is to end up with zucchinis that are softened but not mushy, some beginning to collapse while others still have a bit of bite. Keep stirring the zucchinis, and meanwhile get the pasta in. When the pasta is al dente, remove a large mug of starchy water from the pot before straining. Add the pasta to the zucchinis, grate in the lemon zest, then add the mascarpone and a generous splash of the reserved pasta water. Mix vigorously until the sauce is well combined and coats the pasta, adding more pasta water and mascarpone as needed. Squeeze in the juice of half the lemon, then add the basil and butter. Mix again and taste to check your seasoning. Serve immediately with a drizzle of really good olive oil.",
    "source": "DEEP GREEN PASTA.pdf",
    "servings": "4",
    "time": "30 minutes"
  },
  {
    "id": "36",
    "name": "Oolong Milk Tea and Almond Rice Crispy",
    "category": "dessert",
    "ingredients": [
      "Neutral oil",
      "6 cups crispy rice cereal",
      "4 tablespoons butter",
      "One 10-ounce bag mini marshmallows",
      "1/2 teaspoon vanilla extract",
      "5 to 6 teaspoons finely ground oolong tea",
      "1/2 cup sliced roasted almonds"
    ],
    "instructions": "Brush a large mixing bowl and a large pot with neutral oil. Line a 9-inch square baking pan with parchment paper, leaving extra overhang on each side. Pour the crispy rice cereal into the large oiled bowl and set aside. In the large oiled pot over medium heat, melt the butter, stirring continuously, until it starts to turn a light brown color. Once the butter has lightly browned, turn the heat off and add 4 cups of the marshmallows, the vanilla, and the tea. Continuously stir as the marshmallows melt and form a smooth consistency. Working quickly, pour the melted marshmallow into the large mixing bowl of crispy rice cereal. With a silicone or rubber spatula, stir the cereal and marshmallow together until evenly mixed. Add the remaining marshmallows and the almonds and continue to mix until evenly distributed. Scoop the mixture into the prepared pan, and with oiled or wet fingers, gently press the mixture into the pan to spread evenly. Let cool completely (about 1 hour), then use the parchment paper to lift the treats out of the pan. Cut into squares to serve, or store in an airtight container for up to 3 days.",
    "source": "OOLONG MILK.pdf",
    "servings": "16",
    "time": "30 minutes"
  },
  {
    "id": "37",
    "name": "Roasted Garlic Dip",
    "category": "sauce",
    "ingredients": [
      "2 heads garlic, cloves separated and peeled",
      "1/2 cup extra virgin olive oil, plus more for garnish",
      "Juice of 1 lemon (about 3 tablespoons)",
      "1/4 teaspoon fine sea salt",
      "One 16-ounce container whole milk cottage cheese"
    ],
    "instructions": "Preheat the oven to 250°F. Place the garlic in a small, oven-safe container and cover with the olive oil. Roast for about 2 hours, until the garlic is golden and soft. Let cool. Add 10 roasted garlic cloves, the lemon juice, salt, and cottage cheese to a food processor and process just until smooth. Don't overdo it, or it will get too runny. Serve in a shallow bowl and garnish with a swirl of fresh olive oil and the remaining roasted garlic cloves. Store any leftovers in the fridge in an airtight container for up to 5 days.",
    "source": "Baked by Melissa cookbook.pdf",
    "servings": "2 cups",
    "time": "2 hours 15 minutes"
  },
  {
    "id": "38",
    "name": "Kale Caesar with Garlicky Panko and Simple Salmon",
    "category": "salad",
    "ingredients": [
      "Two 6-ounce organic salmon fillets",
      "Juice of 1 lemon (about 3 tablespoons)",
      "1/4 teaspoon fine sea salt",
      "2 tablespoons extra virgin olive oil",
      "1 garlic clove, grated",
      "Freshly ground black pepper",
      "1 bunch kale (about 1/2 pound), stems removed, leaves sliced thin",
      "1 pound Brussels sprouts, trimmed and shredded",
      "3 to 4 scallions, thinly sliced",
      "Vegan Caesar Dressing",
      "Garlicky Panko for topping"
    ],
    "instructions": "Line a baking sheet with parchment paper. Preheat the oven or air fryer to 400°F. Pat the salmon dry with a paper towel and place it on the prepared baking sheet. Cover with the lemon juice and sprinkle with the salt. Whisk together the olive oil and garlic in a small bowl. Brush the mixture over the salmon and bake for 10 to 15 minutes, until it flakes easily with a fork. While the salmon cooks, combine the kale, Brussels sprouts, and scallions in a large bowl. Season the salmon with freshly ground black pepper. Pour the vegan Caesar dressing over the salad and toss to combine. Top with garlicky panko and salmon.",
    "source": "Baked by Melissa cookbook.pdf",
    "servings": "4-6",
    "time": "25 minutes"
  },
  {
    "id": "39",
    "name": "Farm Stand Salad",
    "category": "salad",
    "ingredients": [
      "4 corn cobs, shucked",
      "1 bunch garlic scapes, finely chopped (optional)",
      "4 red scallions, trimmed, sliced",
      "1 stalk young garlic, chopped",
      "1/2 cup roughly chopped fresh cilantro or parsley",
      "Juice of 2 lemons (about 1/2 cup)",
      "1 teaspoon kosher salt",
      "1/2 cup extra virgin olive oil",
      "1/4 teaspoon freshly ground black pepper",
      "1 cup snap peas, trimmed and cut",
      "1 cup cherry tomatoes, cut in half",
      "1 orange bell pepper, finely chopped",
      "2 medium carrots, julienned",
      "4 or 5 pink radishes, thinly sliced",
      "1/2 cup crumbled feta"
    ],
    "instructions": "Fill a large pot with cold water and add salt. Turn the heat up to medium-high and add the corn. Once the water reaches a rapid boil, take the pot off the heat and cover until you're ready to use the corn. Add the scapes, scallions, garlic, and cilantro to a large bowl. Cover with the lemon juice, salt, olive oil, and black pepper and whisk to combine. Carefully cut the corn kernels off the cob while still hot. Add the kernels to the bowl with the aromatics. The warmth from the corn helps the flavor of the aromatics bloom. Add the snap peas, tomatoes, bell pepper, carrots, and radishes to the bowl. Stir to combine so everything is evenly coated with the dressing. Garnish with more cilantro and the feta.",
    "source": "Baked by Melissa cookbook.pdf",
    "servings": "8-10",
    "time": "30 minutes"
  },
  {
    "id": "40",
    "name": "Soba Slaw with Crispy Tofu",
    "category": "salad",
    "ingredients": [
      "1/2 head red cabbage, shredded",
      "1/2 cup snap peas, trimmed and sliced",
      "1 red bell pepper, thinly sliced",
      "1 bunch scallions, sliced",
      "2 tablespoons finely chopped fresh cilantro",
      "Half of a 9.5-ounce package soba noodles, cooked and cooled",
      "Crispy Tofu",
      "Sesame seeds to garnish",
      "For the dressing: 2 tablespoons soy sauce, 2 tablespoons toasted sesame oil, 1 tablespoon rice vinegar, juice of 1 lemon, 1 tablespoon peanut butter, 2 garlic cloves grated"
    ],
    "instructions": "Mix together the cabbage, snap peas, bell pepper, scallions, and cilantro in a large bowl. Make the dressing: In a small bowl, whisk together the soy sauce, sesame oil, rice vinegar, lemon juice, peanut butter, and garlic until well combined. Pour the dressing over the vegetables and toss to get everything evenly coated. Plate each dish individually by placing the soba noodles on the bottom, then covering with salad. Top with crispy tofu and garnish with sesame seeds.",
    "source": "Baked by Melissa cookbook.pdf",
    "servings": "4-6",
    "time": "25 minutes"
  },
  {
    "id": "41",
    "name": "Little Gem Salad with Calabrian Chile Dressing",
    "category": "salad",
    "ingredients": [
      "For dressing: 1/2 cup extra-virgin olive oil, 1 large egg yolk, 1 oil-packed anchovy fillet, 1 garlic clove, 1 tablespoon lemon juice, 2 teaspoons red wine vinegar, 1/2 teaspoon crushed Calabrian chile peppers, 1/2 teaspoon Dijon mustard, 1/2 teaspoon Worcestershire sauce, 1/4 teaspoon kosher salt, 1/4 teaspoon black pepper, 3 tablespoons finely grated Parmesan",
      "For breadcrumbs: 3 tablespoons extra-virgin olive oil, 1 cup panko, 1/4 teaspoon Italian seasoning, 1/4 teaspoon kosher salt",
      "3 to 4 heads Little Gem lettuce, leaves separated",
      "Grated Parmesan for garnish"
    ],
    "instructions": "Make the Calabrian chile dressing: In the cup that comes with the immersion blender (or in a small bowl with a whisk), combine the olive oil, egg yolk, anchovies, garlic, lemon juice, vinegar, chiles, mustard, Worcestershire sauce, salt, and pepper and blend until smooth. Stir in the Parmesan cheese. Toast the bread crumbs: Heat the olive oil in a medium skillet over medium heat. Add the panko, Italian seasoning, salt, and pepper and cook, stirring frequently, until golden brown, 1 to 2 minutes. Transfer to a small bowl and set aside. To serve, massage the lettuce with the dressing and arrange on a large plate or platter. Sprinkle the toasted bread crumbs over the top. Garnish with some Parm and serve.",
    "source": "Brocc last 3 pages.pdf",
    "servings": "4",
    "time": "30 minutes"
  },
  {
    "id": "42",
    "name": "Pepperoni Cast-Iron Pan Pizza",
    "category": "bread",
    "ingredients": [
      "1 pound store-bought pizza dough",
      "3 tablespoons extra-virgin olive oil, plus more for drizzling",
      "1/2 cup pizza sauce",
      "3 ounces fresh mozzarella cheese, torn or shredded",
      "2 ounces sliced pepperoni",
      "1/2 cup fresh basil leaves",
      "Hot honey for garnish (or 2 tablespoons honey mixed with 1/2 teaspoon red chile flakes)"
    ],
    "instructions": "Let the dough sit at room temperature for 30 minutes. Position one rack in the lowest position and another in the top third of the oven and preheat to 500°F. Add 2 tablespoons of the olive oil to a 10-inch cast-iron skillet. Add the dough and toss to coat in the oil. Spread the dough out evenly to the edges of the pan. Spread the pizza sauce evenly all the way to the edges of the dough. Evenly top with the mozzarella, pepperoni, and basil. Bake on the bottom rack until the cheese is melted and the crust is golden brown, 12 to 14 minutes. Move the pan and broil until the top is nice and bubbling, 1 to 2 minutes. Check the bottom of the pizza—if it's not super crispy, transfer the pan to the stovetop over medium-high heat and cook until browned and crispy, about 1 minute. Let cool for about 2 minutes in the pan and then transfer to a wire rack. Drizzle with olive oil and hot honey and serve.",
    "source": "Brocc last 3 pages.pdf",
    "servings": "2-4",
    "time": "45 minutes"
  },
  {
    "id": "43",
    "name": "Marry Me Chicken Chili",
    "category": "soup",
    "ingredients": [
      "2 boneless, skinless chicken breasts (6 to 8 ounces each)",
      "1.5 teaspoons kosher salt",
      "1/4 teaspoon freshly ground black pepper",
      "3 tablespoons extra-virgin olive oil",
      "1 white onion, diced",
      "4 garlic cloves, finely chopped",
      "1 cup corn kernels",
      "2 (10-ounce) cans diced fire-roasted tomatoes with green chiles",
      "2 cups chicken broth",
      "1 (15-ounce) can black beans, drained and rinsed",
      "1 (4.5-ounce) can green chiles",
      "2 teaspoons chili powder",
      "1 teaspoon ground cumin",
      "1 teaspoon dried oregano",
      "1 teaspoon sweet paprika",
      "6 ounces cream cheese, at room temperature",
      "2 cups roughly chopped curly kale leaves"
    ],
    "instructions": "Season the chicken breasts with 1/2 teaspoon of the salt and 1/4 teaspoon of the pepper. Heat 2 tablespoons of olive oil in a Dutch oven over medium heat. Add the chicken breasts and cook for about 5 minutes per side (not cooked through; it will continue cooking in the chili). Set aside. Add the remaining oil to the Dutch oven along with the onion and garlic and cook until the onion is slightly softened, 3 to 4 minutes. Stir in the corn and cook just to heat through. Add the chicken, tomatoes, chicken broth, beans, green chiles, chili powder, cumin, oregano, paprika, remaining salt, and pepper and stir to combine. Add the cream cheese pieces to the pot and stir to combine. Increase the heat to high and bring the mixture to a boil. Reduce the heat to low, cover, and simmer for 20 minutes. Remove the chicken from the pot, shred or slice it, then return to the pot. Stir in the kale, taste for seasoning, and adjust to your taste. Serve with toppings like green onions, avocado, sour cream, and shredded cheese.",
    "source": "Brocc last 3 pages.pdf",
    "servings": "6-8",
    "time": "40 minutes"
  },
  {
    "id": "44",
    "name": "Kale Salad with Gouda, Honeycrisp & Walnuts",
    "category": "salad",
    "ingredients": [
      "1 cup walnuts",
      "1 bunch curly kale (8 to 10 ounces)",
      "1/2 cup plus 1 teaspoon extra-virgin olive oil",
      "2 tablespoons cider vinegar",
      "1 teaspoon maple syrup",
      "1/2 teaspoon Dijon mustard",
      "1/2 teaspoon kosher salt",
      "Freshly ground black pepper",
      "1 medium Honeycrisp apple, cored and thinly sliced",
      "1/2 cup shaved aged Gouda cheese (about 2 ounces)"
    ],
    "instructions": "Preheat the oven to 350°F. Place the walnuts on a sheet pan and toast in the oven for 10 minutes. Cool, then coarsely chop and set aside. Wash the kale leaves and pat them dry. Cut down both sides of the center rib, discarding the rib. Chop the leaves and place them in a large bowl. Drizzle the kale with 1 teaspoon of the olive oil and massage it into the leaves for 30 seconds, to tenderize them. In a glass measuring cup, combine the vinegar, maple syrup, mustard, salt, and a few grinds of black pepper. Add the remaining 1/2 cup olive oil and whisk vigorously until smooth. Pour the dressing over the kale and toss well. Thinly slice the apple, then stack and cut the slices in half crosswise. Add the apples to the salad, along with the walnuts and the Gouda. Toss well and serve.",
    "source": "cooking real life recipes.pdf",
    "servings": "4",
    "time": "25 minutes"
  },
  {
    "id": "45",
    "name": "Ratatouille Lentil Soup",
    "category": "soup",
    "ingredients": [
      "5 tablespoons extra-virgin olive oil, divided",
      "1 pound eggplant, unpeeled and 1/2-inch diced",
      "1 large yellow onion, chopped",
      "1 pound zucchini, 1/2-inch diced",
      "2 tablespoons minced garlic",
      "1 teaspoon dried oregano",
      "2 tablespoons tomato paste",
      "8 cups low-sodium vegetable broth",
      "1 (14.5-ounce) can crushed tomatoes",
      "1 cup French green lentils, rinsed",
      "1/2 cup jarred roasted red peppers, drained and chopped",
      "2 teaspoons kosher salt",
      "1/2 teaspoon freshly ground black pepper",
      "1/2 cup fresh basil leaves",
      "1 tablespoon balsamic vinegar"
    ],
    "instructions": "In a large pot, heat 3 tablespoons of the olive oil over medium-high heat. Add the eggplant and cook, tossing occasionally, until lightly browned and starting to soften, about 5 minutes. Add the onion and zucchini to the pot, along with the remaining 2 tablespoons olive oil. Reduce the heat to medium and cook until the onion is tender and the zucchini is crisp-tender, 6 to 8 minutes. Add the garlic and oregano and cook for 30 seconds until fragrant. Stir in the tomato paste and cook until it begins to darken in color, about 2 minutes. Add the vegetable broth, crushed tomatoes, lentils, roasted red peppers, salt, and black pepper and bring to a boil. Reduce the heat and simmer uncovered, stirring occasionally, until the lentils are tender, 50 minutes to 1 hour. Off the heat, add the basil and vinegar and stir until the basil has wilted. Serve hot with a drizzle of olive oil.",
    "source": "cooking real life recipes.pdf",
    "servings": "6-8",
    "time": "1 hour 15 minutes"
  },
  {
    "id": "46",
    "name": "Little Gem Salad with Avocado Goddess Dressing",
    "category": "salad",
    "ingredients": [
      "1 teaspoon chopped garlic",
      "3 tablespoons chopped fresh dill",
      "2 tablespoons minced fresh chives or scallions",
      "1 Hass avocado, halved and pitted",
      "1/2 cup mayonnaise",
      "3 tablespoons freshly squeezed lemon juice",
      "Kosher salt and freshly ground black pepper",
      "12 ounces Little Gem lettuce or romaine leaves",
      "Quick-Pickled Red Onion"
    ],
    "instructions": "In a food processor, combine the garlic, dill, and chives and process until finely chopped. Scoop the avocado into the processor and add the mayonnaise, lemon juice, 1 teaspoon salt, and a few grinds of black pepper. Process until smooth. Wash and dry the lettuce leaves in a salad spinner. Place the lettuce in a very large bowl and drizzle about half the dressing over the salad. Add the pickled onions and toss until well mixed. Add more dressing to taste, season with a pinch of salt and black pepper, and serve.",
    "source": "cooking real life recipes.pdf",
    "servings": "4",
    "time": "15 minutes"
  },
  {
    "id": "47",
    "name": "One-Pan Chicken Meatballs with Red Sauce & Spinach",
    "category": "chicken",
    "ingredients": [
      "1/2 cup panko bread crumbs",
      "1/4 cup whole milk",
      "2 garlic cloves, grated",
      "1 pound ground dark meat chicken",
      "1 large egg, lightly beaten",
      "1/2 cup grated Parmesan cheese, divided",
      "3 tablespoons chopped fresh parsley",
      "1/4 teaspoon dried oregano",
      "Extra-virgin olive oil",
      "Kosher salt and freshly ground black pepper",
      "1 (24-ounce) jar good-quality marinara sauce",
      "1 (5-ounce) container baby spinach",
      "Fresh basil leaves (optional)"
    ],
    "instructions": "In a small bowl, combine the panko, milk, and garlic and toss with a fork. Set aside. In a large bowl, combine the chicken, egg, 1/4 cup of the Parmesan, the parsley, oregano, 1 tablespoon olive oil, 1.5 teaspoons salt, and 1/4 teaspoon black pepper. Mix gently but thoroughly. Add the panko mixture and mix until just combined. Coat your hands with oil, then form meatballs about 1.5 inches in diameter. In a 10-inch Dutch oven, heat 3 tablespoons olive oil over medium heat. Add meatballs and cook, turning occasionally, until browned on all sides, about 4 minutes. Return the browned meatballs to the pot and add the marinara sauce and 1/4 cup water. Bring to a boil, then reduce the heat, partially cover, and simmer until the meatballs are cooked through, 10 to 15 minutes. Stir in the spinach and cook until just wilted. Off the heat, stir in the remaining 1/4 cup Parmesan and the basil leaves. Serve hot with pasta, crusty bread, or over polenta.",
    "source": "cooking real life recipes.pdf",
    "servings": "4",
    "time": "35 minutes"
  },
  {
    "id": "48",
    "name": "Spaghetti with Sweet Corn Pesto",
    "category": "pasta",
    "ingredients": [
      "7 tablespoons extra-virgin olive oil, divided",
      "1/2 cup panko bread crumbs",
      "1/4 teaspoon crushed red pepper flakes",
      "Kosher salt and freshly ground black pepper",
      "4 cups fresh corn kernels (from 5 to 7 ears)",
      "2 garlic cloves, smashed and peeled",
      "1/2 cup grated Parmesan cheese",
      "1 pound spaghetti",
      "2 pints cherry tomatoes, cut in half",
      "1 cup fresh basil leaves, torn, divided",
      "Grated lemon zest (optional)"
    ],
    "instructions": "In a large skillet, heat 1 tablespoon of the olive oil over medium heat. Add the panko, pepper flakes, and 1/4 teaspoon salt. Cook, tossing often, until the panko is golden brown, 3 to 5 minutes, then transfer to a small bowl to cool. Bring a large pot of salted water to a boil for the pasta. Add 3 tablespoons of the olive oil to the skillet. Add the corn, garlic, and 1 teaspoon salt and cook until the corn is tender and the garlic is beginning to soften, 4 to 6 minutes. Let cool for 10 minutes. Measure out 3/4 cup of the corn kernels and set aside. Transfer the rest of the corn and garlic to a food processor. Add 1.5 teaspoons salt and 1/4 teaspoon pepper and process until coarsely pureed. With the machine running, pour in the remaining 3 tablespoons olive oil. Add the Parmesan and pulse until just combined. Add the spaghetti to the pot of boiling water and cook until just al dente. Reserving 1 cup of the pasta water, drain. Working quickly, transfer the corn pesto to the pasta pot with 1/2 cup of the reserved pasta water. Bring to a simmer. Off the heat, return the pasta to the pot with the tomatoes, reserved corn kernels, and half the basil leaves. Toss well. Transfer to a serving bowl and top with the remaining basil, lemon zest, and half of the bread crumbs.",
    "source": "cooking real life recipes.pdf",
    "servings": "4-6",
    "time": "45 minutes"
  },
  {
    "id": "49",
    "name": "Red Curry Lentils with Sweet Potatoes & Spinach",
    "category": "vegetarian",
    "ingredients": [
      "3 tablespoons extra-virgin olive oil, divided",
      "1 pound sweet potatoes, peeled and 3/4-inch diced",
      "1 medium yellow onion, chopped",
      "1 tablespoon minced garlic",
      "1 tablespoon grated fresh ginger",
      "3 tablespoons Thai red curry paste",
      "1 small chile pepper, seeded and minced",
      "1 teaspoon ground turmeric",
      "1 cup red lentils, rinsed",
      "4 cups low-sodium vegetable broth",
      "2 teaspoons kosher salt",
      "1 (13-ounce) can full-fat coconut milk",
      "1 (4- to 5-ounce) bag baby spinach",
      "Juice of half a lime",
      "Cooked rice for serving (optional)",
      "Fresh cilantro leaves for serving"
    ],
    "instructions": "In a medium Dutch oven, heat 2 tablespoons of the olive oil over medium-high heat. Add the sweet potatoes and cook, tossing occasionally, until they are browned all over, 5 to 7 minutes. Transfer to a plate and set aside. Add the remaining 1 tablespoon olive oil to the pot and reduce the heat to medium-low. Add the onion and cook until translucent, 4 to 6 minutes. Add the garlic, ginger, red curry paste, chile, and turmeric and cook for 1 minute, until fragrant. Add the lentils, vegetable broth, salt, and reserved sweet potatoes and bring to a boil. Reduce the heat and simmer, uncovered and stirring occasionally, until the lentils are just tender, 20 to 25 minutes. Add the coconut milk and simmer, stirring occasionally, until the liquid has reduced and the lentils are creamy and falling apart, 15 to 20 more minutes. Add the spinach and cook, tossing often, until just wilted, 2 to 3 minutes. Off the heat, stir in the lime juice and taste for seasonings. Serve in shallow bowls, over rice, if using. Garnish with cilantro.",
    "source": "cooking real life recipes.pdf",
    "servings": "4",
    "time": "1 hour"
  },
  {
    "id": "50",
    "name": "Maple-Roasted Squash with Grapes, Shallots & Rosemary",
    "category": "side",
    "ingredients": [
      "2 small delicata squash (about 1.5 pounds total)",
      "1.5 cups seedless red grapes, stems removed",
      "3 medium shallots, sliced 1/4-inch thick",
      "2 fresh rosemary sprigs",
      "3 tablespoons extra-virgin olive oil",
      "Kosher salt and freshly ground black pepper",
      "1 tablespoon maple syrup",
      "1 tablespoon apple cider vinegar"
    ],
    "instructions": "Preheat the oven to 425°F. Cut the delicata squash in half lengthwise, scoop out the seeds, and slice crosswise into 1/2-inch-thick half-moons. Place on a sheet pan, along with the grapes, shallots, and rosemary. Drizzle with the olive oil and sprinkle with 3/4 teaspoon salt and a few grinds of black pepper. Toss well and spread into an even layer. Roast for 30 minutes, tossing once halfway through. Drizzle the maple syrup over the vegetables and toss. Return to the oven until the squash is nicely caramelized, about 5 minutes. Immediately add the vinegar to the pan and toss, scraping up any browned bits from the pan. Sprinkle with salt, transfer to a serving dish, and serve warm or at room temperature.",
    "source": "cooking real life recipes.pdf",
    "servings": "4",
    "time": "40 minutes"
  },
  {
    "id": "51",
    "name": "Peanut Butter & Ginger Cookies",
    "category": "dessert",
    "ingredients": [
      "1 stick (4 ounces) unsalted butter, at room temperature",
      "3/4 cup creamy all-natural peanut butter",
      "1/2 cup granulated sugar",
      "1/2 cup lightly packed light brown sugar",
      "2 tablespoons molasses",
      "1 large egg, at room temperature",
      "1 cup all-purpose flour",
      "1/2 teaspoon ground ginger",
      "1/2 teaspoon kosher salt",
      "1/2 teaspoon baking powder",
      "1/4 teaspoon baking soda",
      "1/2 cup finely chopped crystallized ginger"
    ],
    "instructions": "In a stand mixer fitted with the paddle attachment, combine the butter, peanut butter, granulated sugar, brown sugar, and molasses and mix on low speed until combined. Raise the speed to medium-high speed and mix until light and fluffy, about 3 minutes. With the mixer on low, add the egg and mix until fully incorporated. In a medium bowl, whisk together the flour, ground ginger, salt, baking powder, and baking soda. With the mixer still on low, gradually add the dry ingredients and mix until just combined. Fold in the crystallized ginger and refrigerate the dough for at least 30 minutes. When ready to bake, preheat the oven to 350°F and line two sheet pans with parchment paper. Scoop two-tablespoon balls of dough onto the prepared sheet pan, spacing a couple inches apart. Bake one pan at a time until the cookies are just starting to brown at the edges but are still soft to the touch, 14 to 16 minutes. Let cool for 10 minutes on the pan before transferring to a wire rack.",
    "source": "cooking real life recipes.pdf",
    "servings": "20-24 cookies",
    "time": "1 hour"
  },
  {
    "id": "52",
    "name": "Cauliflower Mac and Cheese",
    "category": "pasta",
    "ingredients": [
      "1/2 head cauliflower, cored and broken into florets",
      "2 cups water",
      "2 cups skim milk, divided",
      "8 ounces whole-wheat medium shells",
      "1 teaspoon Dijon mustard",
      "1/2 teaspoon kosher salt",
      "1/4 teaspoon cayenne pepper",
      "1 cup grated sharp cheddar cheese, divided",
      "1/2 cup grated provolone cheese, divided",
      "1/4 cup grated Parmesan cheese",
      "3 links spicy chicken sausage, diced",
      "3 tablespoons whole-wheat panko bread crumbs",
      "1 tablespoon grated Parmesan cheese",
      "1/2 teaspoon smoked paprika"
    ],
    "instructions": "Combine the cauliflower florets, water, and 1 cup of the milk in a Dutch oven and bring to a boil. Lower to a simmer, cover with a lid, and cook for 20 minutes or until the cauliflower is very tender. Meanwhile, bring a separate pot of salted water to a boil for the pasta. Cook the pasta until a few minutes shy of al dente. Drain and set aside. Preheat the oven to 375°F. Drain the cauliflower and transfer to a blender. Puree until very smooth. Return the cauliflower puree to the Dutch oven over medium-low heat and whisk in the remaining 1 cup milk, Dijon, salt, and cayenne. Slowly add 3/4 cup of the cheddar, 1/2 cup of the provolone, and the Parmesan and whisk until melted and smooth. Heat a medium skillet over medium heat. Add the diced chicken sausage and cook for 5 to 6 minutes until lightly browned. Stir the chicken sausage into the cheese sauce, then stir in the pasta. Transfer to a 9 x 9-inch baking dish. Top with the remaining cheddar and provolone. Combine the panko, Parmesan, and paprika for topping and sprinkle on top. Bake for 20 minutes or until the cheese has melted and is bubbling.",
    "source": "dude diet recipes.pdf",
    "servings": "4-6",
    "time": "50 minutes"
  },
  {
    "id": "53",
    "name": "Trashed-Up Turkey Burgers",
    "category": "chicken",
    "ingredients": [
      "3 slices turkey bacon",
      "1 pound lean ground turkey",
      "1/2 ripe avocado, pitted, peeled, and mashed",
      "2 garlic cloves, minced",
      "1 teaspoon smoked paprika",
      "1/2 teaspoon freshly ground black pepper",
      "1/4 teaspoon ground cumin",
      "1/4 teaspoon kosher salt",
      "1 tablespoon extra-virgin olive oil",
      "4 slices pepper Jack cheese",
      "4 whole-grain burger buns",
      "Boston lettuce, tomato slices, red onion slices for serving"
    ],
    "instructions": "Cook the turkey bacon in a skillet over medium heat until browned and crispy, about 4 to 5 minutes per side. Transfer to a paper towel-lined plate to cool, then finely chop. Place the ground turkey in a mixing bowl and add the chopped turkey bacon, avocado, garlic, paprika, pepper, cumin, and salt and mix until well combined. With damp hands, mold the turkey mixture into 4 patties, about 1 inch thick. Heat the olive oil in a large nonstick skillet over medium heat. When hot and shimmering, carefully add the burgers to the pan. Cook for 6 to 7 minutes, undisturbed, until lightly browned on the undersides and beginning to firm, then flip and cook for another 6 minutes on the opposite sides. During the last 2 minutes of cooking, top each patty with a slice of cheese and let it melt. Serve the turkey burgers on buns, piled high with lettuce, tomato, and onion.",
    "source": "dude diet recipes.pdf",
    "servings": "4",
    "time": "30 minutes"
  },
  {
    "id": "54",
    "name": "Fish Tacos with Mango-Avocado Salsa",
    "category": "seafood",
    "ingredients": [
      "1/2 cup whole-wheat panko bread crumbs",
      "1 teaspoon chili powder",
      "1 teaspoon smoked paprika",
      "Pinch of cayenne pepper",
      "2 tablespoons extra-virgin olive oil",
      "1 pound halibut fillet, skin removed, cut into 1-inch strips",
      "Kosher salt and freshly ground black pepper",
      "2 large egg whites, lightly beaten",
      "8 small flour tortillas",
      "For salsa: 1 ripe mango diced, 1 ripe avocado diced, 1/4 small red onion finely chopped, 1/2 cup fresh cilantro chopped, juice of 1 lime",
      "For crema: 1/2 cup nonfat plain yogurt, 1.5 teaspoons lime juice, 1/2 chipotle pepper minced, 1/2 teaspoon adobo sauce, 1/2 teaspoon honey"
    ],
    "instructions": "Start by making the salsa. Place all the salsa ingredients in a medium bowl and gently mix to combine. Cover and refrigerate. Preheat the oven to 375°F. Line a baking sheet with parchment paper. Combine the panko, chili powder, paprika, and cayenne in a small bowl. Heat the olive oil in a large nonstick skillet over medium heat. When hot, add the panko mixture and stir to coat with the oil. Toast for 2 to 3 minutes until the panko darkens slightly. Transfer to a shallow bowl and let cool. Pat the halibut dry and season both sides with salt and pepper. Dip each piece of fish in the egg whites, shake off any excess, and coat it in the seasoned panko. Place on the baking sheet. Bake for 10 minutes. Meanwhile, stir together all the crema ingredients in a small bowl, and warm the tortillas. Assemble your tacos: Each tortilla gets a piece of fish, a heaping spoonful of salsa, and a generous dollop of crema.",
    "source": "dude diet recipes.pdf",
    "servings": "4",
    "time": "35 minutes"
  },
  {
    "id": "55",
    "name": "Bulletproof Chicken Breasts",
    "category": "chicken",
    "ingredients": [
      "Two 8-ounce boneless, skinless chicken breasts",
      "Kosher salt",
      "Freshly ground black pepper",
      "1 tablespoon olive oil"
    ],
    "instructions": "Pat the chicken breasts dry with paper towels and season both sides generously with salt and pepper. Heat a large skillet or sauté pan over medium-high heat. When hot, add the olive oil and swirl to coat the bottom of the pan. Lower the heat to medium and add the chicken breasts. Cook for 1 minute, then flip the breasts over. Reduce the heat to low, cover the pan with a tight-fitting lid, and cook for 10 minutes. DO NOT LIFT THE LID. After 10 minutes, turn off the heat and let the chicken sit, covered, for an additional 10 minutes. Again, DO NOT LIFT THE LID. After the full 20 minutes, remove the lid. Your chicken will be perfectly cooked through, tender, and juicy.",
    "source": "dude diet recipes.pdf",
    "servings": "2",
    "time": "25 minutes"
  },
  {
    "id": "56",
    "name": "Go-To Frittata",
    "category": "breakfast",
    "ingredients": [
      "6 large eggs",
      "1 teaspoon hot sauce (optional)",
      "Pinch of kosher salt",
      "1 teaspoon extra-virgin olive oil",
      "1 link spicy chicken sausage, diced",
      "1 red bell pepper, diced",
      "1/4 small yellow onion, thinly sliced",
      "1 garlic clove, minced",
      "1/2 cup grated cheddar or Mexican blend cheese",
      "1/4 cup salsa",
      "1 tablespoon chopped fresh cilantro (optional)"
    ],
    "instructions": "In a medium bowl, whisk together the eggs, hot sauce, and salt. Set aside. Preheat the broiler on high. Heat the olive oil in a 10-inch nonstick, ovenproof skillet over medium heat. When hot, add the sausage and cook for about 3 minutes until lightly browned. Add the bell pepper, onion, and garlic and cook for 3 to 4 minutes until the vegetables are just tender. Pour the eggs into the pan and cook for about 3 minutes until the eggs are beginning to set. Sprinkle with the cheese and cook for another 2 minutes until your frittata is almost set, but the top is still a little bit runny. Place the skillet under the broiler. Broil for 1 to 2 minutes until the cheese has melted and the top of the frittata is puffed up and very lightly browned. Loosen the frittata from the pan with a spatula and slide it onto a cutting board. Slice in half or quarters, transfer to plates, and top with salsa and cilantro if you like.",
    "source": "dude diet recipes.pdf",
    "servings": "2",
    "time": "20 minutes"
  },
  {
    "id": "57",
    "name": "Chicken, Peanut & Soba Noodle Salad",
    "category": "salad",
    "ingredients": [
      "1 lemon, sliced",
      "1 bay leaf",
      "2 boneless, skinless chicken breasts",
      "1 (10-ounce) package gluten-free soba noodles",
      "1/2 cup smooth peanut butter",
      "1/4 cup toasted sesame oil",
      "2 tablespoons rice wine vinegar",
      "1/4 cup filtered water",
      "2 tablespoons coconut aminos",
      "1/2 garlic clove",
      "2 to 3 medium carrots, peeled and shredded",
      "1/4 head cabbage, shredded",
      "3 scallions, thinly sliced",
      "1/2 cup cilantro, chopped",
      "1 fresh Thai chili, sliced (optional)",
      "Sea salt to taste",
      "1/4 cup sesame seeds, toasted",
      "1/4 cup dry roasted peanuts, roughly chopped"
    ],
    "instructions": "In a large pot, bring 8 cups of heavily salted water to a boil. Add the lemon slices and bay leaf, then add the chicken. Bring to a boil and turn off the heat. Allow to cook for at least 20 minutes, but up to 1 hour. Remove the chicken from the water, allow to cool, then shred with two forks and set aside. Cook the soba noodles according to package directions. Drain and run cold water over the cooked noodles to stop the cooking process. To make the dressing, in a blender, combine the peanut butter, sesame oil, rice wine vinegar, water, coconut aminos, and garlic, and blend until smooth and creamy. In a large bowl, combine the carrots, cabbage, scallions, cilantro, Thai chili, soba noodles, and shredded chicken. Toss to combine and season lightly with salt. Add the dressing and stir to coat, then add the sesame seeds and peanuts. Serve cool.",
    "source": "foodwise recipes.pdf",
    "servings": "4-6",
    "time": "45 minutes"
  },
  {
    "id": "58",
    "name": "Fusilli with Braised Chicken Thighs and Sun-Dried Tomato Pesto",
    "category": "pasta",
    "ingredients": [
      "6 sun-dried tomatoes, drained",
      "1 cup fresh basil",
      "1 garlic clove",
      "1/4 cup toasted pine nuts",
      "1/2 cup plus 2 tablespoons extra-virgin olive oil",
      "2 tablespoons lemon juice, divided",
      "Sea salt and freshly ground black pepper",
      "1 pound boneless, skinless chicken thighs",
      "1/2 cup chicken stock",
      "4 ounces gluten-free fusilli",
      "10 to 20 button mushrooms, quartered",
      "4 cups spinach",
      "Red pepper flakes for serving"
    ],
    "instructions": "Make the sun-dried tomato pesto. In a food processor, combine the sun-dried tomatoes, basil, garlic, pine nuts, 1/2 cup of the olive oil, and 1 tablespoon of the lemon juice, and pulse until combined. Season with salt and pepper and set aside. In a large skillet, heat 1 tablespoon of the olive oil over high heat. Season the chicken thighs with salt and pepper, then add to the hot pan. Cook until brown, about 3 minutes on one side, then flip and brown the other side. Add the chicken broth and bring to a boil. Reduce the heat to a simmer and cook until the liquid evaporates, 5 to 10 minutes. While the chicken is braising, cook the pasta according to the package instructions. Drain and set aside. Remove the chicken from the pan and let it cool. In the same skillet over high heat, deglaze with the remaining tablespoon of lemon juice. Add the remaining tablespoon of olive oil, then the mushrooms. Season with salt and stir continuously for about 3 minutes, then reduce the heat to a simmer. Add the spinach and stir until wilted. Using two forks, shred the chicken into bite-size pieces. Add the chicken to the skillet, followed by the pasta and the sun-dried tomato pesto. Stir the pesto to coat the pasta and serve with a sprinkle of sea salt and some red pepper flakes.",
    "source": "foodwise recipes.pdf",
    "servings": "2-4",
    "time": "40 minutes"
  },
  {
    "id": "59",
    "name": "All-the-Crispy-Bits Mac and Cheese",
    "category": "pasta",
    "ingredients": [
      "4 tablespoons unsalted butter, melted, plus more for the sheet pan",
      "12 ounces sharp cheddar cheese, coarsely grated",
      "12 ounces Gruyère cheese, coarsely grated",
      "1 cup panko bread crumbs",
      "1/2 cup finely grated Parmigiano-Reggiano cheese",
      "1/2 teaspoon kosher salt",
      "Pinch of cayenne pepper",
      "Freshly ground black pepper",
      "1 pound cavatappi or other twisty pasta",
      "3 cups whole milk",
      "2 teaspoons smoked paprika",
      "2.5 cups water"
    ],
    "instructions": "Preheat to 425°F. Generously butter a half-sheet pan and line with parchment paper. In a large bowl, mix together the cheddar and Gruyère. Measure out 3 cups of the cheese mixture and set aside for the topping. In a small bowl, combine the panko, Parmigiano-Reggiano, melted butter, salt, and cayenne. Season with black pepper and stir until the bread crumbs are evenly coated. In a large pot, combine the pasta, milk, and water. Set over medium-high heat and bring to a lively simmer, stirring occasionally. Reduce to a gentle simmer and cook, stirring often, until al dente, 3 to 4 minutes. Remove from heat and stir in the smoked paprika. Add the cheese mixture from the large bowl, one handful at a time, stirring to melt after each addition. Season with black pepper. Transfer the mixture to the prepared sheet pan and spread in an even layer. Cover with the reserved cheeses and sprinkle with the bread crumb mixture. Bake for 20 to 30 minutes, rotating the pan front to back halfway through, until deeply golden and crispy. Let sit for 10 minutes before serving.",
    "source": "Hot Sheet Recipes.pdf",
    "servings": "8-10",
    "time": "45 minutes"
  },
  {
    "id": "60",
    "name": "Cheesy Orzo with Mushrooms",
    "category": "pasta",
    "ingredients": [
      "12 to 16 ounces sliced fresh mushrooms (Baby Bella, button, or shiitake)",
      "1 large yellow onion, halved and sliced",
      "3 tablespoons extra-virgin olive oil",
      "1 teaspoon kosher salt",
      "1/4 teaspoon freshly ground black pepper",
      "3 cups vegetable broth, hot",
      "1.5 tablespoons Dijon mustard",
      "1 pound orzo",
      "One 8-ounce ball fresh mozzarella cheese, torn into pieces",
      "1 cup shredded low-moisture mozzarella cheese",
      "1 cup grated Parmigiano-Reggiano cheese, divided",
      "Small handful of fresh flat-leaf parsley leaves, for serving",
      "Lemon wedges, for serving"
    ],
    "instructions": "Preheat to 400°F. In a large bowl, toss together the mushrooms, onion, and oil until combined. Season with the salt and pepper and toss again. Spread the mixture on a half-sheet pan and roast for about 25 minutes, or until the mushrooms and onions start to caramelize. Transfer to a heatproof surface. In the same bowl, whisk together the broth and mustard until combined. Add the orzo and the broth mixture to the sheet pan and carefully stir to incorporate. Pat down the orzo to ensure it's completely submerged in the broth, adding more broth if needed. Scatter both kinds of mozzarella and half of the Parmigiano-Reggiano on top. Return to the oven and bake for 20 to 25 minutes, or until the liquid is mostly absorbed and patches of cheese become burnished. Remove from the oven, scatter the remaining Parmigiano-Reggiano over, and top with the parsley. Squeeze the lemon wedges over everything and season to taste with more salt and pepper. Serve right away.",
    "source": "Hot Sheet Recipes.pdf",
    "servings": "6-8",
    "time": "50 minutes"
  },
  {
    "id": "61",
    "name": "Gnocchi with Broccoli and Lemony Ricotta",
    "category": "pasta",
    "ingredients": [
      "One 17.6-ounce package shelf-stable or refrigerated potato gnocchi",
      "1 pound broccoli florets",
      "3 tablespoons extra-virgin olive oil, plus more for drizzling",
      "2 teaspoons dried oregano",
      "1 teaspoon kosher salt",
      "1/4 teaspoon crushed red pepper flakes",
      "Freshly ground black pepper",
      "1/3 cup heavy cream",
      "1 cup whole-milk ricotta cheese",
      "1 lemon",
      "1/2 cup finely grated Parmigiano-Reggiano cheese",
      "Fresh basil leaves, for garnish"
    ],
    "instructions": "Preheat to 400°F. In a large bowl, mix together the gnocchi, broccoli, oil, oregano, salt, and red pepper flakes. Season with black pepper. Spread in a single layer on a half-sheet pan. Drizzle the heavy cream over everything, followed by 1/4 cup water. Cover tightly with foil. Bake for 10 minutes. Meanwhile, place the ricotta in a small bowl. Grate the lemon zest into the bowl and season to taste with salt and pepper. Stir to combine. Cut the zested lemon into wedges and set aside. Remove the hot sheet from the oven, uncover (discard the foil), and sprinkle the Parmigiano-Reggiano over everything. Return to the oven and bake for about 15 minutes, or until the gnocchi and broccoli are starting to brown. Turn on the broiler and broil for 2 to 4 minutes, or until everything is golden brown. Dollop the lemony ricotta over the gnocchi and broccoli. Garnish with basil leaves and serve with the lemon wedges for squeezing over.",
    "source": "Hot Sheet Recipes.pdf",
    "servings": "4",
    "time": "35 minutes"
  },
  {
    "id": "62",
    "name": "Dilly Feta-Stuffed Zucchini with Mint and Pine Nuts",
    "category": "side",
    "ingredients": [
      "3 tablespoons extra-virgin olive oil, divided",
      "4 zucchini (8 oz each)",
      "1 medium yellow onion, finely chopped",
      "4 ounces feta cheese or chèvre",
      "Handful of minced fresh dill, plus more for garnish",
      "1/4 cup toasted pine nuts, plus more for garnish",
      "Freshly ground black pepper",
      "1/2 cup finely grated Parmigiano-Reggiano cheese, plus more for sprinkling",
      "Fresh mint leaves, for garnish",
      "Lemon wedges, for squeezing"
    ],
    "instructions": "Preheat to 350°F. Lightly brush a half-sheet pan with oil. Trim off the stem ends of the zucchini, halve them lengthwise, and use a dessert spoon to scoop out the flesh and reserve, leaving a shell 1/4 inch thick. Arrange the shells, cut sides up, on one side of the prepared sheet pan. Arrange the onion in a mound on the other side. Drizzle the onion with 1 tablespoon of the oil, gently stirring to coat. Roast for about 15 minutes, or until both the zucchini and onion are softened. While the shells are roasting, in a food processor, combine the zucchini flesh, feta cheese, dill, pine nuts, the remaining 2 tablespoons oil, and a generous pinch of pepper and process until smooth and creamy. Remove the sheet pan from the oven, move the rack about 6 inches from the broiling element, and turn on the broiler. Fold the softened onion into the filling mixture until combined. Divide the filling among the zucchini shells. Arrange the filled zucchini shells on the sheet pan. Sprinkle the tops with the Parmigiano-Reggiano. Broil the stuffed zucchini for 3 to 5 minutes, or until the filling is bubbling and deep golden. Remove from the oven, drizzle with a little oil, and sprinkle with more Parmigiano-Reggiano, pine nuts, and mint leaves. Serve warm, with lemon wedges for squeezing over.",
    "source": "Hot Sheet Recipes.pdf",
    "servings": "4",
    "time": "35 minutes"
  },
  {
    "id": "63",
    "name": "Brown Butter Banana Bread",
    "category": "bread",
    "ingredients": [
      "375 grams peeled bananas (about 4 medium)",
      "2 large eggs",
      "1 large egg yolk",
      "2 teaspoons pure vanilla extract",
      "1 teaspoon Diamond Crystal kosher salt",
      "170 grams (12 tablespoons) unsalted butter, cut into pieces",
      "Softened butter and granulated sugar for coating the pan",
      "225 grams (1 cup plus 2 tablespoons) granulated sugar",
      "1.5 teaspoons baking powder",
      "1/4 teaspoon baking soda",
      "225 grams (1 3/4 cups plus 2 tablespoons) all-purpose flour"
    ],
    "instructions": "In a stand mixer fitted with the paddle attachment (or large heatproof bowl with hand mixer), mash the bananas until mostly smooth with some chunks. Add the eggs, yolk, vanilla, and salt and mix on medium until combined. In a small saucepan, melt the butter over medium heat, stirring frequently, until it turns golden brown and smells nutty, about 5 minutes. Watch carefully so it doesn't burn. Brush a 9 x 5-inch metal loaf pan with softened butter and coat with sugar, tapping out excess. With the mixer on low, gradually drizzle the hot brown butter into the banana mixture. Once combined, add the sugar and mix until incorporated. Add the baking powder, baking soda, and flour and mix on low just until no streaks of flour remain. Pour the batter into the prepared pan and smooth the top. Let rest at room temperature for 1 hour (this helps develop a crackly top). Meanwhile, preheat the oven to 350°F. Bake for 60-70 minutes, until deep golden brown and a tester inserted in the center comes out clean. Let cool in the pan for 15 minutes, then turn out onto a wire rack to cool completely.",
    "source": "Sohla Recipes.pdf",
    "servings": "1 loaf",
    "time": "3 hours"
  },
  {
    "id": "64",
    "name": "Bolognese with Cannellini Beans and Cream",
    "category": "pasta",
    "ingredients": [
      "1 pound fresh or dried pasta (corzetti, cavatelli, or fettuccine)",
      "Extra-virgin olive oil",
      "2 tablespoons unsalted butter",
      "4 ounces pancetta or prosciutto, diced",
      "Finely diced celery",
      "Finely diced carrot",
      "Finely diced onion",
      "4 garlic cloves",
      "1 bay leaf",
      "1/2 teaspoon kosher salt",
      "Freshly ground black pepper",
      "1/2 pound ground pork",
      "1/2 pound ground veal or beef",
      "1/2 cup good dry white wine",
      "1 cup chicken stock",
      "One 15-ounce can cannellini beans, rinsed and drained",
      "1 cup heavy cream",
      "1/2 cup finely chopped flat-leaf parsley",
      "1/2 cup finely chopped marjoram or thyme",
      "Juice of 1/2 lemon"
    ],
    "instructions": "In a large heavy-bottomed frying pan or Dutch oven over medium heat, warm 2 tablespoons olive oil and butter. Add the pancetta, celery, carrot, onion, garlic, and bay leaf; season with the salt and pepper; and sauté, stirring often, for 20 to 25 minutes. Make sure to really cook this soffritto down to get it caramelized. Transfer to a bowl and set aside. Turn the heat to medium-high and add the pork, veal, and a splash more oil if needed, to the pan. Cook the meat, breaking it up with a wooden spoon, until browned, 8 to 10 minutes. Add the wine to the pan and deglaze, scraping up the browned bits with a wooden spoon. Let simmer for a few minutes, then add the chicken stock, beans, cream, parsley, marjoram, and pancetta-soffritto mixture. Lower the heat and let simmer for 10 to 15 minutes, stirring occasionally. Finally, stir in the lemon juice. Meanwhile bring a large pot of lightly salted water to a boil. Add the pasta and cook until al dente. Using a large spider or slotted spoon, transfer the pasta into a large bowl and stir in a splash of olive oil to stop it from sticking together. Toss the pasta with the Bolognese sauce and serve.",
    "source": "simple pasta.pdf",
    "servings": "4-6",
    "time": "1 hour"
  },
  {
    "id": "65",
    "name": "Ginger Garlic Chicken Noodle Soup",
    "category": "soup",
    "ingredients": [
      "2 pounds boneless, skinless chicken thighs",
      "4 garlic cloves, thinly sliced",
      "1-inch piece ginger, peeled, finely chopped",
      "1 bundle (6 to 8 ounces) scallions, thinly sliced, whites and greens separated",
      "4 teaspoons kosher salt",
      "Freshly ground white or black pepper",
      "10 cups water",
      "8 ounces dried curly or other dried ramen-style noodles",
      "1 cup sliced carrot, cut into thin matchsticks",
      "1/4 cup black rice vinegar",
      "1/4 cup soy sauce",
      "2 tablespoons toasted sesame oil",
      "Crispy chili oil, to taste"
    ],
    "instructions": "Bring the chicken, garlic, ginger, scallion whites (reserve greens), salt, pepper, and water to a boil in a 4-to-5 quart pot. Reduce the heat to medium-low, and simmer, uncovered, stirring occasionally, until the chicken is very tender and cooked through, about 15 minutes. While the soup simmers, whisk together the vinegar, soy sauce, and sesame oil in a bowl, and add as much crispy chili oil as desired. Remove chicken from broth and shred. Add noodles and carrots to the broth and cook until tender. Return shredded chicken to pot. Ladle into bowls and drizzle with the vinegar-soy mixture. Top with reserved scallion greens.",
    "source": "smitten kitchen.pdf",
    "servings": "4 to 6",
    "time": "45 minutes"
  },
  {
    "id": "66",
    "name": "Winter Squash Soup with Red Onion Crisp",
    "category": "soup",
    "ingredients": [
      "1 large onion (finely dice 1/2 cup, thinly slice the rest)",
      "3 tablespoons vegetable oil, divided",
      "3 garlic cloves, minced",
      "1-inch piece ginger, minced",
      "1 teaspoon ground cumin",
      "1/2 teaspoon red pepper flakes",
      "1 teaspoon kosher salt",
      "One 14-ounce can butternut or other winter squash puree, or 2 cups fresh roasted squash",
      "One 13.5-ounce can coconut milk",
      "1 1/2 cups vegetable broth",
      "1/2 cup thinly sliced red onion for crisp"
    ],
    "instructions": "Prep your onions: Finely dice 1/2 cup onion, and set it aside. Thinly slice the rest. Heat 2 tablespoons oil in a large pot over medium heat. Add the thinly sliced onion, garlic, ginger, cumin, red-pepper flakes, and salt, and sauté until tender, about 8 to 10 minutes. Add the squash, and cook in the onion spice mixture for 1 minute. Add the coconut milk and broth, and scrape up anything stuck to the bottom of the pot. Bring the soup to a simmer. Reduce heat to keep it simmering, cover the pot, and cook until flavors meld, about 20 minutes. Blend until smooth. For red onion crisp: fry reserved diced onion in remaining oil until crispy. Serve soup topped with red onion crisp.",
    "source": "smitten kitchen.pdf",
    "servings": "4",
    "time": "40 minutes"
  },
  {
    "id": "67",
    "name": "Slow-Simmered Lentils with Kale and Goat Cheese",
    "category": "vegetarian",
    "ingredients": [
      "1/2 pound lacinato or dinosaur kale (half a standard bunch)",
      "3 tablespoons olive oil, divided",
      "1 small yellow onion, diced small",
      "2-3 garlic cloves, minced",
      "1 tablespoon tomato paste",
      "1 cup small green lentils (ideally French du Puy), rinsed",
      "2 1/2 to 3 cups vegetable broth",
      "Kosher salt",
      "Freshly ground black pepper",
      "2 tablespoons sherry vinegar or red-wine vinegar",
      "4-ounce log goat cheese, cut into segments",
      "Thick slices country or sourdough bread, toasted, for serving"
    ],
    "instructions": "Strip the leaves from the stems of the kale, and tear the leaves into bite-sized pieces. Discard stems. Heat 2 tablespoons olive oil in a medium-sized heavy pot (a Dutch oven works well) over medium heat. Add the onion and garlic, and cook until the onion is translucent and beginning to soften, 4 to 5 minutes. Add the kale leaves, and cook until they start to wilt, 2 to 3 minutes. Add the tomato paste, and cook for 1 minute. Add the lentils, 2 1/2 cups broth, 1 teaspoon kosher salt, and many grinds of black pepper. Bring to a boil, then reduce to a very low simmer. Cover. Cook for 60 minutes, until the lentils are tender but not collapsed. If the lentils look thick like they may dry out before they cook through, add the last 1/2 cup broth. Stir in vinegar. Serve in bowls, drop a piece of goat cheese into each, and serve with toasted bread.",
    "source": "smitten kitchen.pdf",
    "servings": "4",
    "time": "1 hour 15 minutes"
  },
  {
    "id": "68",
    "name": "Spiced Sweet Potato Oven Fries",
    "category": "side",
    "ingredients": [
      "1 1/2 pounds sweet potatoes, unpeeled, cut into wedges",
      "2 tablespoons olive oil",
      "1 1/4 teaspoons kosher salt, divided",
      "1/2 teaspoon garlic powder",
      "1/2 teaspoon ground coriander",
      "1/2 teaspoon ground cumin",
      "1/4 teaspoon ground cayenne",
      "1/4 teaspoon ground cardamom",
      "For yogurt sauce:",
      "1 cup plain yogurt",
      "1 tablespoon vinegar",
      "1 garlic clove, minced",
      "Harissa, for swirling"
    ],
    "instructions": "Heat the oven to 400°F, and line a baking sheet with parchment paper. Toss the potatoes with olive oil. Add 1 teaspoon kosher salt, garlic powder, coriander, cumin, cayenne, and cardamom, and toss to coat evenly. Spread the potatoes on the prepared baking sheet, separating the fries as much as possible, and roast until they're brown underneath, 15 minutes. Flip the fries, and roast for another 10 minutes, then return to the oven for a final 5 minutes, until they're nicely brown and blistered all over. For the yogurt sauce: combine the yogurt, vinegar, remaining 1/4 teaspoon salt, and garlic. Dollop the harissa on top, and use a knife to marble it in. Serve fries immediately with the yogurt sauce.",
    "source": "smitten kitchen.pdf",
    "servings": "4",
    "time": "35 minutes"
  },
  {
    "id": "69",
    "name": "Baked Orzo and Artichokes",
    "category": "pasta",
    "ingredients": [
      "2 tablespoons olive oil",
      "1 tablespoon unsalted butter",
      "4 scallions, thinly sliced, white and green parts separated",
      "1 medium onion, thinly sliced into half-moons",
      "Two 14-ounce cans artichoke hearts in water, drained, roughly chopped",
      "Finely grated zest and juice of 1 lemon",
      "Kosher salt and freshly ground black pepper",
      "8 ounces uncooked orzo",
      "3 tablespoons minced fresh parsley",
      "2 tablespoons minced fresh mint",
      "3/4 cup grated Parmesan, divided",
      "2 1/2 cups vegetable broth"
    ],
    "instructions": "Heat the oven to 350°F. Heat oil and butter in a large oven-safe skillet over medium heat. Add scallion whites and onion, and cook until softened. Add artichokes, lemon zest, salt, and pepper, and cook for a few minutes. Add orzo and stir to coat. Pour the broth over the top. Cover and bake until orzo is tender and liquid is absorbed, about 25-30 minutes. Stir in lemon juice, parsley, mint, scallion greens, and half the Parmesan. Top with remaining Parmesan and serve.",
    "source": "smitten kitchen.pdf",
    "servings": "4",
    "time": "45 minutes"
  },
  {
    "id": "70",
    "name": "Zucchini and Pesto Lasagna",
    "category": "pasta",
    "ingredients": [
      "2 pounds zucchini, diced",
      "3 tablespoons olive oil, divided",
      "Kosher salt and freshly ground black pepper",
      "4 tablespoons unsalted butter",
      "1/4 cup all-purpose flour",
      "3 cups whole milk",
      "2 garlic cloves, minced",
      "1 cup ricotta cheese",
      "12 lasagna noodles",
      "6 tablespoons basil pesto",
      "1 1/2 cups grated Parmesan"
    ],
    "instructions": "Preheat oven to 375°F. Sauté zucchini in 2 tablespoons oil with salt until tender. Make the sauce: Melt the butter in a large saucepan over medium-high heat. Once melted, add the flour all at once, and stir until smooth. Add the milk, a small glug at a time, whisking constantly so no lumps form. Add the minced garlic, 1 1/2 teaspoons salt, and black pepper, and bring the sauce to a boil, stirring frequently. The sauce will thicken. Reduce the heat to medium, and simmer for 2 to 3 minutes. Stir in the ricotta, and remove from heat. Cook lasagna noodles according to package. Assemble: Spread 1/2 cup ricotta sauce in bottom of a 9x13 baking dish. Layer noodles, sauce, zucchini, pesto, and Parmesan. Repeat 3 times. Top with final noodles, remaining sauce and Parmesan. Cover with foil and bake 30 minutes. Remove foil, bake another 20 minutes until golden and bubbling.",
    "source": "smitten kitchen.pdf",
    "servings": "8",
    "time": "1 hour 30 minutes"
  },
  {
    "id": "71",
    "name": "Weeknight Lemon Chicken Wings",
    "category": "chicken",
    "ingredients": [
      "3 tablespoons unsalted butter, melted",
      "1 1/2 teaspoons smooth Dijon mustard",
      "3 garlic cloves, minced",
      "2 teaspoons kosher salt, plus more to finish",
      "1 teaspoon freshly ground black pepper",
      "2 lemons (1 whole for zesting, 1 thinly sliced)",
      "2 pounds chicken wings, cut in half at the joint"
    ],
    "instructions": "Heat the oven to 450°F. Coat a 9x13-inch baking sheet with nonstick spray. Combine the butter, Dijon mustard, garlic, salt, and pepper. Finely grate the zest of the whole lemon, and add it to the butter mixture. Add the chicken and lemon slices and toss to coat, then spread them evenly in the prepared pan. Season with additional salt and pepper, and roast for 35 minutes, flipping the wings and lemon slices once after the 20-minute mark, and then back to the first side for the last 5 minutes, until the wings are a deep golden brown. To serve: Slice the zested lemon in half, and squeeze the juice over the tray; cut the second half into wedges for serving. Eat hot.",
    "source": "smitten kitchen.pdf",
    "servings": "3 to 4",
    "time": "40 minutes"
  },
  {
    "id": "72",
    "name": "Skillet Chicken Parmesan",
    "category": "chicken",
    "ingredients": [
      "1 1/2 pounds boneless, skinless chicken thighs",
      "Kosher salt and freshly ground black pepper",
      "2 large eggs",
      "1 cup breadcrumbs",
      "1 cup grated Parmesan, divided",
      "Vegetable oil, for frying",
      "2 tablespoons olive oil",
      "3 garlic cloves, minced",
      "1/2 teaspoon dried oregano",
      "Red pepper flakes, to taste",
      "One 28-ounce can crushed tomatoes",
      "8 ounces fresh mozzarella, sliced"
    ],
    "instructions": "Pat the chicken dry and season well on both sides with salt and pepper. In one shallow bowl, beat the eggs with a fork. Fill a second shallow bowl with breadcrumbs and 1/2 cup of the Parmesan. Dip each piece of chicken into the egg, let excess drip off, then coat with breadcrumb mixture. Heat vegetable oil in a 10-to-12-inch oven-safe skillet over medium heat. Cook the chicken, flipping once, until deep golden brown on both sides, about 4 to 5 minutes on the first side and 3 to 4 on the second. Drain on paper towels and season with salt. Drain oil from pan and wipe clean. Heat olive oil over medium heat. Add garlic, oregano, and pepper flakes, and let sizzle until garlic is golden, 30 seconds to 1 minute. Add tomatoes and 1 teaspoon salt. Simmer for 8 to 10 minutes until slightly thickened. Heat broiler. Arrange chicken in sauce, spoon some sauce on top leaving edges exposed. Sprinkle with remaining Parmesan and mozzarella. Broil until cheese is melted and browned.",
    "source": "smitten kitchen.pdf",
    "servings": "4",
    "time": "45 minutes"
  }
]