[
  {
    "id": "1",
    "name": "Single Serve Shakshuka",
    "category": "vegetarian",
    "ingredients": [
      "1 cup cherry tomatoes",
      "1/4 - 1/2 tsp chili flakes",
      "1/4 - 1/2 cup cottage cheese",
      "2-3 eggs",
      "Everything but the bagel seasoning (optional)",
      "Fresh herbs (dill, parsley or your favorite)",
      "Bread to serve",
      "1 clove garlic (optional)",
      "Salt",
      "Olive oil"
    ],
    "instructions": "Start your tomatoes. Add tomatoes to a small frying pan, drizzle with a bit of oil and salt, cover and cook for 15 minutes. As tomatoes start to open and turn jammy, squish them so they turn saucy. At this point, add chili flakes and continue to cook until broken down into a sauce. Make your toast. While your tomatoes cook, either toast or grill your bread. To grill, heat a good glug olive oil in a small frying pan over medium heat. Once hot, add bread and grill until golden on both sides and sprinkle with salt. Once bread is toasted or grilled, take a peeled garlic clove and rub it across the bread. Finish your shakshuka. Once tomatoes are cooked, add dollops of cottage cheese throughout your pan. Make little pockets in your tomatoes with a spoon and crack eggs in, cover and cook for 3-6 minutes (4 for soft yolk, 6 for hard). Remove from heat, remove lid and sprinkle with EBTB seasoning or sesame seeds, salt, and fresh herbs. Serve with toast.",
    "source": "20_Minute_Single_Serve_Shakshuka.pdf",
    "servings": "1",
    "time": "20 minutes"
  },
  {
    "id": "2",
    "name": "Cauliflower Bolognese",
    "category": "pasta",
    "ingredients": [
      "12 oz mushrooms (shiitake or crimini), stems removed",
      "1 medium head of cauliflower (about 2 1/4 lb), broken into florets",
      "1/4 cup plus 2 Tbsp extra-virgin olive oil, plus more for drizzling",
      "4 Tbsp unsalted butter, divided",
      "1 large onion, finely chopped",
      "6 garlic cloves, thinly sliced",
      "1 chile (serrano, Holland, or Fresno), thinly sliced",
      "1 Tbsp finely chopped rosemary",
      "1/3 cup double-concentrated tomato paste",
      "Kosher salt",
      "1 lb rigatoni",
      "2 oz finely grated Parmesan (about 1 cup), plus more for serving",
      "3 Tbsp finely chopped parsley",
      "1/2 lemon"
    ],
    "instructions": "Pulse mushrooms in a food processor until finely chopped. Transfer to a small bowl. Wipe out food processor bowl. Working in 3 batches, pulse cauliflower in food processor until pieces are about the size of a grain of rice. Heat 1/4 cup oil and 2 Tbsp butter in a Dutch oven over medium-high. Add mushrooms and cook, stirring occasionally, until golden brown, 4-6 minutes. Add onion and 2 Tbsp oil. Cook until onion is very soft and golden brown, 6-8 minutes. Add garlic, chile, and rosemary and cook until garlic is softened, about 3 minutes. Add tomato paste and cook until slightly darkened, about 2 minutes. Add cauliflower and cook until it begins to stick to bottom of pot, 6-8 minutes. Season with salt. Meanwhile, cook pasta until almost al dente. Using a slotted spoon, transfer pasta to pot with sauce. Add 1 cup Parmesan, remaining 2 Tbsp butter, and 1 cup pasta cooking liquid. Increase heat to medium and cook until pasta is al dente and sauce is clinging to pasta, about 3 minutes. Remove from heat and stir in parsley. Finely zest lemon over pasta. Divide among bowls and top with more Parmesan.",
    "source": "Cauliflower Bolognese Recipe _ Bon Appétit copy.pdf",
    "servings": "6",
    "time": "45 minutes"
  },
  {
    "id": "3",
    "name": "Turkey Stuffing Meatballs",
    "category": "chicken",
    "ingredients": [
      "1 1/2 cups (1/2-inch) sourdough or white bread cubes",
      "1/2 cup olive oil",
      "1/2 cup chicken stock",
      "1/2 cup finely chopped white onion",
      "1/2 cup finely chopped celery",
      "2 teaspoons dried sage",
      "1 teaspoon dried thyme",
      "1 teaspoon onion powder",
      "1 teaspoon celery salt",
      "1 large egg",
      "Salt and freshly ground black pepper",
      "Crushed red pepper",
      "1 pound ground turkey (preferably 85 percent lean)",
      "Gravy or cranberry sauce, for serving"
    ],
    "instructions": "Heat oven to 350 degrees. Spread the bread cubes on a small sheet pan and bake until brittle, about 10 minutes. Cool completely. Reset oven to 400 degrees. Add the bread cubes, olive oil, chicken stock, onion, celery, sage, thyme, onion powder, celery salt, egg, 1 teaspoon salt, 1 teaspoon black pepper and a pinch of red pepper to a bowl and mix. Let sit for up to 15 minutes to ensure the bread is fully moistened. Add turkey and mix until just combined, being careful not to overmix. Form the meat mixture into 15 balls and place on a baking sheet. Bake for 14 to 16 minutes, until cooked through and the edges have browned. Remove from oven and let rest for 5 minutes. Serve with gravy or cranberry sauce.",
    "source": "dan pelosi Turkey Stuffing Meatballs Recipe.pdf",
    "servings": "15 meatballs",
    "time": "1 hour"
  },
  {
    "id": "4",
    "name": "Kale Salad with Pecorino and Walnuts",
    "category": "salad",
    "ingredients": [
      "1/2 cup walnut halves or pieces",
      "1/4 cup golden raisins",
      "1 tablespoon white wine vinegar",
      "1 tablespoon water",
      "1/4 cup panko or homemade breadcrumbs",
      "1 tiny clove garlic, minced or pressed",
      "Coarse or kosher salt",
      "3 tablespoons olive oil",
      "1 bunch tuscan kale (about 14 ounces)",
      "2 ounces pecorino cheese, grated (1/2 cup)",
      "Juice of half a lemon",
      "Freshly ground black pepper or red pepper flakes"
    ],
    "instructions": "Heat oven to 350. Toast walnuts on a baking sheet for 10 minutes, tossing once. Let cool and coarsely chop. In a small saucepan over low heat, simmer white wine vinegar, water and raisins for 5 minutes, until plump and soft. Set aside. Toast bread crumbs, garlic and 2 teaspoons olive oil in a skillet with a pinch of salt until golden. Set aside. Trim heavy stems off kale and remove ribs. Stack sections of leaves and roll them into a tube, then cut them into very thin ribbons crosswise. Put kale in a large bowl. Add pecorino, walnuts and raisins, remaining 2 tablespoons olive oil and lemon juice and toss until all the kale ribbons are coated. Season with salt, pepper and reserved vinegar mixture. Let sit for 10 minutes. Toss with breadcrumbs before serving.",
    "source": "kale salad with pecorino and walnuts – smitten kitchen.pdf",
    "servings": "4",
    "time": "30 minutes"
  },
  {
    "id": "5",
    "name": "Red Lentil Soup",
    "category": "soup",
    "ingredients": [
      "3 tablespoons olive oil, plus more for drizzling",
      "1 large onion, chopped",
      "2 garlic cloves, minced",
      "1 tablespoon tomato paste",
      "1 teaspoon ground cumin",
      "Salt and black pepper",
      "Pinch of chili powder or ground cayenne",
      "1 quart chicken or vegetable broth",
      "1 cup red lentils",
      "1 large carrot, peeled and diced",
      "Juice of 1/2 lemon",
      "3 tablespoons chopped fresh cilantro"
    ],
    "instructions": "In a large pot, heat 3 tablespoons oil over high until hot and shimmering. Add onion and garlic, and sauté until golden, about 4 minutes. Stir in tomato paste, cumin, 1/4 teaspoon each salt and black pepper and the chili powder, and sauté for 2 minutes longer. Add broth, 2 cups water, lentils and carrot. Bring to a simmer, then partly cover pot and turn heat to medium-low. Simmer until lentils are soft, about 30 minutes. Taste and add salt if necessary. Using an immersion or regular blender or a food processor, purée half the soup, then add it back to pot. The soup should be somewhat chunky. Reheat soup if necessary, then stir in lemon juice and cilantro. Serve soup drizzled with good olive oil and dusted lightly with chili powder.",
    "source": "Red Lentil Soup Recipe (with Video).pdf",
    "servings": "4",
    "time": "45 minutes"
  },
  {
    "id": "6",
    "name": "Saucy Gochujang Noodles with Chicken",
    "category": "chicken",
    "ingredients": [
      "3 tablespoons soy sauce",
      "2-3 tablespoons gochujang sauce",
      "2 tablespoons tomato paste",
      "2 tablespoons peanut butter",
      "2 tablespoons water",
      "1-2 tablespoons brown sugar",
      "1 tablespoon sesame oil",
      "1 clove minced garlic",
      "1-2 cups broth or water for thinning",
      "1 pound ground chicken",
      "1/2 teaspoon salt",
      "Freshly ground black pepper",
      "2 packets ramen or stir fry noodles",
      "1-2 cups fresh spinach",
      "1/4 cup chives, scallions, cilantro or herbs for topping",
      "1 tablespoon chili oil for finishing",
      "1 tablespoon sesame seeds for finishing"
    ],
    "instructions": "Whisk the sauce ingredients (except the extra broth) in a small bowl or shake together in a jar. It should form a thick sauce. Cook the chicken in a large skillet over medium high heat. Season generously with salt and pepper. Boil the noodles for just a few minutes to soften. Drain and set aside. When the chicken is done, add spinach, cooked noodles, and sauce to the pan, keeping it over medium high heat. Toss to combine; heat until the spinach is wilted. Add extra water or broth to thin the sauce, a little at a time, to get the sauciness that you like. Serve topped with fresh herbs, scallions, chili oil, sesame seeds.",
    "source": "Saucy Gochujang Noodles with Chicken Recipe - Pinch of Yum.pdf",
    "servings": "4-6",
    "time": "30 minutes"
  },
  {
    "id": "7",
    "name": "Braised Chickpeas with Zucchini and Pesto",
    "category": "vegetarian",
    "ingredients": [
      "2 15-ounce cans of chickpeas, drained and rinsed",
      "1 1/2 to 2 cups vegetable broth",
      "4 garlic cloves, thinly sliced",
      "1 large yellow onion, halved and thinly sliced",
      "1/4 teaspoon red pepper flakes",
      "1 1/2 teaspoons kosher salt",
      "1 pound summer squash or zucchini, quartered lengthwise, thinly sliced",
      "1/4 cup olive oil",
      "1/4 cup prepared or storebought basil pesto",
      "8 ounces of burrata or 1 cup fresh ricotta",
      "Grated parmesan cheese, to finish",
      "Sliced sourdough or country bread, grilled or toasted"
    ],
    "instructions": "Place chickpeas and 1 1/2 cups broth in a large braiser or saucepan. Scatter garlic, onion, pepper flakes, salt, and zucchini on top and drizzle olive oil over. No need to stir. Bring to a simmer and cover to cook for 45 minutes total. At the 15-minute mark, remove the lid. At the 30-minute mark, stir ingredients. If liquid is gone or chickpeas are sticking, add remaining 1/2 cup broth. Remove from heat and stir in pesto in dollops. Make divots for the burrata, using your fingers to tear it into chunks before nudging them into the pan. Finish with parmesan and extra pepper flakes. Ladle into low bowls and serve with grilled bread.",
    "source": "SK chickpeas & zucchini.pdf",
    "servings": "4",
    "time": "1 hour"
  },
  {
    "id": "8",
    "name": "Rigatoni with Eggplant Purée",
    "category": "pasta",
    "ingredients": [
      "1 medium eggplant, cut into 1-inch cubes",
      "1 pint (2 cups) cherry tomatoes",
      "3 cloves garlic, peeled",
      "3 tablespoons olive oil",
      "1 teaspoon kosher salt",
      "1 teaspoon freshly ground black pepper",
      "1 teaspoon red pepper flakes (adjust to taste)",
      "1 pound dried rigatoni pasta",
      "1/4 cup torn fresh mint or basil leaves, plus extra for garnish",
      "3 tablespoons olive oil",
      "1/2 cup grated Parmesan or ricotta salata",
      "1/4 cup toasted pine nuts"
    ],
    "instructions": "Heat oven to 400 degrees F. Line a large baking sheet with parchment paper. In a large bowl combine the eggplant, cherry tomatoes, garlic, 3 tablespoons olive oil, salt, pepper, and red pepper flakes. Spread the vegetables out in an even layer on the baking sheet. Roast until the vegetables are tender and the eggplant is golden, about 35 minutes. Meanwhile, bring a large pot of salted water to a boil. Add the pasta and cook until tender but a full minute shy of done, about 8 to 10 minutes. Drain pasta but reserve a cup of the cooking water. Transfer the roasted vegetables to a food processor or blender. Add the torn mint or basil leaves and additional 3 tablespoons olive oil. Blend until almost smooth. Return the pasta to the cooking pot, pour sauce over it and a splash (about 1/3 cup) of cooking water and cook together, tossing so that the pasta is evenly coated, over medium-high heat for 1 to 2 minutes. Transfer pasta and sauce to a serving bowl; garnish with extra herbs, pine nuts and parmesan.",
    "source": "SK rigatoni with eggplant.pdf",
    "servings": "4-6",
    "time": "50 minutes"
  },
  {
    "id": "9",
    "name": "Roasted Carrots with Avocados and Furikake Seeds",
    "category": "side",
    "ingredients": [
      "3 tablespoons sunflower seeds",
      "3 tablespoons pumpkin seeds",
      "3 tablespoons furikake, plus more to taste",
      "3 medium garlic cloves",
      "1 teaspoon kosher salt",
      "1 teaspoon fennel seeds",
      "1 teaspoon coriander seeds",
      "1 teaspoon fresh thyme leaves",
      "1/4 teaspoon freshly ground black pepper",
      "1/4 teaspoon crushed red pepper flakes",
      "1/4 cup plus 2 tablespoons extra-virgin olive oil",
      "1 tablespoon red wine vinegar",
      "1 pound small carrots, scrubbed",
      "2 oranges, halved",
      "2 avocados"
    ],
    "instructions": "Make the furikake seeds: Position a rack in the middle of the oven and preheat to 350F. On a quarter sheet pan, spread the sunflower and pumpkin seeds in a single layer. Toast, stirring occasionally, 8 to 9 minutes, or until lightly toasted and golden. Don't let the seeds brown too much. Transfer to a small bowl, stir in the furikake, and set aside. Leave the oven on for the carrots. Make the citrus carrots: Line a half sheet pan with parchment paper. In a mini food processor, combine the garlic, salt, fennel, coriander, thyme, black pepper, and pepper flakes. Pulse until roughly chopped, then add 1/4 cup of the oil and the vinegar and process until the marinade is uniform. If you don't have a mini food processor, finely chop the aromatics until almost uniform, then whisk together with the oil and vinegar in a small bowl.",
    "source": "Hot Sheet Recipes.pdf",
    "servings": "4",
    "time": "45 minutes"
  },
  {
    "id": "10",
    "name": "Spiced Yogurt Chicken with Chickpeas and Eggplant",
    "category": "chicken",
    "ingredients": [
      "3/4 cup plain whole-milk yogurt",
      "1/4 cup almond flour",
      "4 garlic cloves, finely chopped",
      "3 tablespoons extra-virgin olive oil",
      "1 tablespoon plus 1 teaspoon kosher salt",
      "1 teaspoon ground cumin",
      "1/2 teaspoon ground coriander",
      "1/2 teaspoon ground turmeric",
      "1/4 teaspoon ground cinnamon",
      "Several grinds of black pepper",
      "8 pieces bone-in, skin-on chicken legs (about 3 1/2 to 4 kg total)",
      "12 ounces small eggplant, cut into 1-inch pieces",
      "3 shallots, halved lengthwise",
      "One 15-ounce can chickpeas, drained and rinsed",
      "Fresh cilantro leaves for serving"
    ],
    "instructions": "In a large bowl, mix together the yogurt, almond flour, garlic, olive oil, salt, cumin, coriander, turmeric, cinnamon, and black pepper. Add the chicken and rub the mixture evenly over it, carefully getting it under the skin without removing it. Cover and refrigerate for at least 2 hours and up to overnight. When ready to roast, position a rack in the middle of the oven and preheat to 425F. Place the eggplant in a colander and sprinkle with the 1 teaspoon salt. Toss to coat and set aside to drain for 30 minutes. Pat dry with paper towels, absorbing any moisture. On a half-sheet pan, toss the eggplant and chickpeas with the remaining 3 tablespoons oil. Lightly season with salt and pepper. Scoop the chicken out of the marinade and nestle, skin side up, among the eggplant and chickpeas, keeping everything in an even layer. It will be snug. Drizzle any remaining yogurt marinade over the chicken skin. Roast for about 1 hour, stirring the eggplant and chickpea halves through, or until the chicken is deeply golden brown and cooked through and the eggplant is completely softened and browning at the edges. Remove from the oven, garnish with cilantro, and serve.",
    "source": "Hot Sheet Recipes.pdf",
    "servings": "4-6",
    "time": "1 hour 30 minutes"
  },
  {
    "id": "11",
    "name": "Chicken Legs with Prunes, Pancetta, and Potatoes",
    "category": "chicken",
    "ingredients": [
      "5 tablespoons extra-virgin olive oil, divided",
      "2 tablespoons herbes de Provence",
      "1 tablespoon dark brown sugar",
      "1 tablespoon sherry vinegar or red wine vinegar",
      "2 teaspoons kosher salt, plus more as needed",
      "Freshly ground black pepper",
      "4 bone-in, skin-on chicken legs (about 3 1/2 to 4 lbs total)",
      "12 ounces small potatoes, such as fingerling or creamer potatoes, halved or quartered if large",
      "3 shallots, halved lengthwise and cut into 1/2-inch slices",
      "4 ounces pancetta cubes (or coarsely chopped bacon)",
      "1 cup prunes",
      "1/4 cup boiling water"
    ],
    "instructions": "Position a rack in the middle of the oven and preheat to 425F. In a medium bowl, combine 3 tablespoons of the oil, the herbes de Provence, brown sugar, sherry vinegar, salt, and lots of pepper. Add the chicken legs and mix to coat all over. On a half-sheet pan, toss the potatoes, shallots, and pancetta with the remaining 2 tablespoons oil. Season lightly with salt and pepper and mix well to combine. Make room for the chicken legs and nestle them, skin side up, among the other ingredients on the sheet pan. Drizzle any remaining marinade over the chicken. Roast for 30 minutes. Meanwhile, place the prunes in a heatproof medium bowl and pour the boiling water over them. Set aside, stirring from time to time. After 30 minutes, stir the shallots and potatoes and add the prunes, scattering them around the chicken and potatoes. Drizzle the prune soaking liquid over everything. Roast for 15 to 20 minutes more, or until the chicken is cooked through, the skin is browned, and the potatoes and shallots are tender and golden brown. Serve on a large platter or divide among four plates.",
    "source": "Hot Sheet Recipes.pdf",
    "servings": "4",
    "time": "1 hour"
  },
  {
    "id": "12",
    "name": "Quick Rigatoni Bolognese",
    "category": "pasta",
    "ingredients": [
      "2 tablespoons kosher salt",
      "16 ounces rigatoni, or pasta of choice",
      "1/4 cup extra-virgin olive oil",
      "1 medium yellow onion, finely diced",
      "1 carrot, peeled and finely diced",
      "2 garlic cloves, finely chopped",
      "1 1/4 teaspoons kosher salt",
      "1/2 teaspoon freshly ground black pepper",
      "1/2 pound ground beef, 85% lean",
      "1/2 pound ground pork",
      "1 (6-ounce) can tomato paste",
      "1 tablespoon balsamic vinegar",
      "1 (28-ounce) can crushed San Marzano tomatoes, undrained",
      "1/2 cup half-and-half",
      "1/4 teaspoon red chile flakes",
      "Grated Parmesan cheese, for serving",
      "Finely chopped fresh parsley or basil, optional"
    ],
    "instructions": "Bring a large pot of water and the salt to a boil. Add the pasta to the boiling water and cook to al dente according to the package directions. Meanwhile, heat the olive oil in a Dutch oven or large pot over medium-high heat. Add the onion and carrot and cook, stirring occasionally, until softened, about 2 minutes. Add the garlic, salt, and pepper, and cook until the garlic is softened and fragrant, 30 seconds to 1 minute. Add the beef and pork and use a wooden spoon to break up and flatten the meat. Let it cook, undisturbed, until browned, about 2 minutes. Reduce the heat to medium, stir the meat to break it up, and add the tomato paste and vinegar. Stir to evenly coat the meat and cook, stirring occasionally, until the tomato paste darkens and the sugars caramelize, 1 to 2 minutes. Add the crushed tomatoes and juices, half-and-half, and chile flakes, stir to combine, and continue to cook until the pasta is ready. When the pasta is done, scoop out 1/2 cup of the pasta water and reserve. Drain the pasta and stir it into the sauce. Vigorously stir in the reserved pasta water. Transfer to serving dishes and top with Parmesan. Garnish with fresh parsley or basil if desired.",
    "source": "Brocc first 10 pages.pdf",
    "servings": "6-8",
    "time": "30 minutes"
  },
  {
    "id": "13",
    "name": "Date Night Chicken in Creamy Mushroom Sauce",
    "category": "chicken",
    "ingredients": [
      "2 boneless, skinless chicken breasts (about 1 1/2 pounds)",
      "1 1/2 teaspoons kosher salt",
      "1/2 teaspoon freshly ground black pepper",
      "2 tablespoons extra-virgin olive oil",
      "5 tablespoons unsalted butter",
      "3 large shallots, thinly sliced",
      "4 garlic cloves, finely chopped",
      "12 ounces baby bella (cremini) mushrooms, thinly sliced",
      "3 tablespoons fresh thyme leaves",
      "1/2 tablespoon balsamic vinegar",
      "2 tablespoons all-purpose flour",
      "1 1/2 cups chicken broth",
      "1/2 cup half-and-half",
      "1/4 cup grated Parmesan"
    ],
    "instructions": "Season the chicken breasts with salt and pepper. Heat the olive oil in a large skillet over medium-high heat. Add the chicken and cook until golden brown and cooked through, about 6-8 minutes per side. Transfer to a plate. Add the butter to the skillet. Once melted, add the shallots and cook until softened, about 3 minutes. Add the garlic and mushrooms and cook, stirring occasionally, until the mushrooms are golden brown and tender, about 8 minutes. Add the thyme and balsamic vinegar and cook for 1 minute. Sprinkle the flour over the mushrooms and stir to combine. Cook for 1 minute. Gradually add the chicken broth, stirring constantly. Add the half-and-half and bring to a simmer. Cook until the sauce thickens, about 3-4 minutes. Stir in the Parmesan. Return the chicken to the skillet and spoon the sauce over it. Serve immediately.",
    "source": "Brocc first 10 pages.pdf",
    "servings": "2",
    "time": "30 minutes"
  },
  {
    "id": "14",
    "name": "Crispy Italian Sausage & Broccolini Orecchiette",
    "category": "pasta",
    "ingredients": [
      "Fresh pasta: 1 recipe Simple Semolina Dough, shaped into orecchiette, OR 14 ounces dried orecchiette or cavatelli",
      "1 bunch (about 10 ounces) broccolini",
      "1/4 cup extra-virgin olive oil",
      "1 shallot, finely chopped",
      "3 garlic cloves, finely chopped",
      "3 links (12 to 14 ounces) sweet or hot Italian sausage, casings removed",
      "1/4 cup chopped flat leaf parsley",
      "1/2 teaspoon kosher salt",
      "Freshly ground black pepper",
      "2 tablespoons unsalted butter",
      "1/3 cup grated Parmigiano-Reggiano, plus more for topping",
      "1/4 to 1/2 teaspoon red pepper flakes"
    ],
    "instructions": "Bring two large pots of lightly salted water to a boil. Trim the broccolini and slice the stems into 1/4-inch pieces, leaving at least 1 inch of the stem on every floret. Add the broccolini stems and florets to one of the pots of boiling water and blanch until crisp-tender, 2 to 3 minutes. Drain in a colander and set aside. In a large frying pan over medium-low heat, warm the olive oil. Add the shallot and garlic and sauté for a couple of minutes. Add the sausage, turn the heat to medium-high, and cook, breaking it up into small pieces with a wooden spoon, until it's deliciously brown and crisp, 12 to 15 minutes. Then add the broccolini and parsley, season with the salt and pepper, and stir to combine. Keep warm. Add the orecchiette to the second pot of boiling water and cook for 3 to 4 minutes, or according to package instructions if using store-bought. Using a large spider or slotted spoon, transfer the pasta into the sausage mixture along with the butter, Parmigiano, and 1/2 cup of the pasta water and toss to combine. Serve the pasta topped with more Parmigiano and the red pepper flakes.",
    "source": "simple pasta.pdf",
    "servings": "4",
    "time": "35 minutes"
  },
  {
    "id": "15",
    "name": "Cavatelli with Sausage, Peppers & Oregano",
    "category": "pasta",
    "ingredients": [
      "14 ounces cavatelli pasta",
      "1/4 cup extra-virgin olive oil",
      "1 pound Italian sausage, casings removed",
      "1 onion, finely diced",
      "1 bay leaf",
      "1 teaspoon kosher salt",
      "1/2 teaspoon freshly ground black pepper",
      "4 garlic cloves, finely chopped",
      "2 tablespoons tomato paste",
      "1 cup chicken stock",
      "3 bell peppers (mix of red, yellow, green), seeded and diced",
      "1 tablespoon finely chopped fresh oregano",
      "2 tablespoons sherry vinegar",
      "1/2 cup heavy cream",
      "Finely grated Parmigiano-Reggiano for sprinkling",
      "Red pepper flakes for sprinkling"
    ],
    "instructions": "In a large heavy-bottomed frying pan or Dutch oven over medium heat, warm the olive oil. Add the sausage, onion, and bay leaf; season with the salt and pepper; and cook for 10 minutes, breaking the meat into small pieces with a wooden spoon. Add the garlic to the pan and sauté for 1 minute, then add the tomato paste and continue to cook for another minute or two. Add the chicken stock and bell peppers. Cook, stirring occasionally, until the peppers are soft and the liquid has reduced, about 15-20 minutes. Meanwhile, cook the cavatelli according to package directions. Stir in the oregano, sherry vinegar, and heavy cream. Add the cooked pasta and toss to coat. Serve topped with Parmigiano and red pepper flakes.",
    "source": "simple pasta.pdf",
    "servings": "4-6",
    "time": "40 minutes"
  },
  {
    "id": "16",
    "name": "Ginger Garlic Chicken Noodle Soup",
    "category": "soup",
    "ingredients": [
      "2 pounds boneless, skinless chicken thighs",
      "4 garlic cloves, thinly sliced",
      "1-inch piece ginger, peeled, finely chopped",
      "1 bundle (6 to 8 ounces) scallions, thinly sliced, whites and greens separated",
      "4 teaspoons kosher salt",
      "Freshly ground white or black pepper",
      "10 cups water",
      "8 ounces dried curly or other dried ramen-style noodles",
      "1/2 cup sliced carrot, cut into thin matchsticks",
      "1/4 cup black rice vinegar",
      "1/4 cup soy sauce",
      "2 tablespoons toasted sesame oil",
      "Crispy chili oil, to taste"
    ],
    "instructions": "Bring the chicken, garlic, ginger, scallion whites, salt, pepper, and water to a boil in a 4-to-5-quart pot. Reduce the heat to medium-low, and simmer, uncovered, stirring occasionally, until the chicken is very tender and cooked through, about 15 minutes. While the soup simmers, whisk together the vinegar, soy sauce, and sesame oil in a bowl, and add as much chili crisp as your heart desires. Add the noodles and carrots to the pot and cook until the noodles are tender, about 3-4 minutes. Remove from heat. Shred the chicken with two forks. Ladle soup into bowls. Drizzle with the soy-vinegar mixture and top with reserved scallion greens.",
    "source": "smitten kitchen keepers recipes.pdf",
    "servings": "4-6",
    "time": "45 minutes"
  },
  {
    "id": "17",
    "name": "Simple Black Bean Chili",
    "category": "vegetarian",
    "ingredients": [
      "1 medium poblano, halved, seeds removed",
      "1 jalapeño or habanero chili, halved, seeds removed",
      "1 medium white onion, trimmed, cut into 8 wedges",
      "2 large garlic cloves, unpeeled",
      "2 tablespoons vegetable oil, divided",
      "1 1/2 teaspoons kosher salt",
      "1 teaspoon chipotle chili powder",
      "2 teaspoons ground cumin",
      "1 teaspoon dried oregano",
      "One 14.5-ounce can crushed tomatoes (fire-roasted if available)",
      "Two 15.5-ounce cans black beans, drained and rinsed",
      "Water, if needed",
      "Handful of chopped fresh cilantro leaves",
      "Juice of 1/2 lime",
      "Sour cream, sliced scallions, avocado, pickled jalapeños, for garnishes"
    ],
    "instructions": "Heat your broiler. Arrange the poblano, jalapeño, onion wedges, and garlic on a sheet pan. Drizzle with 1 tablespoon oil. Broil until charred in spots and softened, turning as needed, about 10-15 minutes. Let cool slightly, then peel the garlic. Transfer everything to a blender. Add the salt, chipotle powder, cumin, oregano, and crushed tomatoes. Blend until smooth. In a large pot or Dutch oven, heat the remaining tablespoon of oil over medium heat. Add the blended sauce and cook, stirring, for 5 minutes. Add the black beans and 1/2 cup water if needed. Simmer for 15 minutes, stirring occasionally. Stir in cilantro and lime juice. Serve in bowls topped with sour cream, scallions, avocado, and pickled jalapeños.",
    "source": "smitten kitchen.pdf",
    "servings": "4-6",
    "time": "45 minutes"
  },
  {
    "id": "18",
    "name": "Braised Eggplant with Parm Vibes",
    "category": "vegetarian",
    "ingredients": [
      "3 medium Japanese eggplants (about 1 1/2 pounds total), tops trimmed and halved lengthwise",
      "Kosher salt",
      "5 tablespoons extra-virgin olive oil",
      "4 garlic cloves, thinly sliced",
      "1 teaspoon chili flakes",
      "1 pint cherry tomatoes (12 ounces)",
      "1/2 cup water",
      "4 ounces part-skim mozzarella cheese, torn into 1/4-inch chunks",
      "1/4 cup coarsely grated parmesan cheese",
      "1/4 cup lightly packed fresh basil leaves",
      "Crusty bread, buttered pasta, or polenta to serve"
    ],
    "instructions": "Position a rack in the center of the oven and set the broiler to high. Heat a large cast-iron or broilerproof stainless steel skillet over medium-high heat until barely smoking. While the skillet heats, season the cut sides of the eggplant with salt. Add 3 tablespoons of the olive oil to the pan and swirl to coat. Quickly arrange the eggplant in the pan cut-side down. Use a fish spatula to firmly press the eggplant pieces down. Cook until lightly charred and starting to soften, about 5 minutes. Remove the skillet from the heat and transfer the eggplant to a plate. Add the remaining 2 tablespoons olive oil, the garlic, and chili flakes to the skillet. Cook over medium heat, stirring constantly, until fragrant, about 1 minute. Add the cherry tomatoes and water and cook until the tomatoes are softened, pressing them with the back of the spatula to burst them all, 4 to 6 minutes. Season with salt. Return the eggplant to the skillet and cook until tender and the sauce has reduced and thickened slightly, about 5 minutes. Taste the sauce and add salt if needed. Dot the pan with the torn mozzarella and sprinkle with the parmesan. Transfer to the oven and broil until the cheese melts and browns, about 1 minute. Tear the basil leaves and scatter on top. Serve immediately with crusty bread, buttered pasta, or polenta.",
    "source": "Sohla Recipes.pdf",
    "servings": "4",
    "time": "30 minutes"
  },
  {
    "id": "19",
    "name": "Zucchini Spaghetti",
    "category": "pasta",
    "ingredients": [
      "1/4 cup extra-virgin olive oil",
      "10 garlic cloves, thinly sliced",
      "8 medium zucchini (about 3 pounds), halved lengthwise and thinly sliced crosswise",
      "Kosher salt",
      "1 cup water",
      "2 teaspoons chili flakes",
      "1 pound spaghetti",
      "1/2 cup lightly packed fresh mint leaves, plus more for garnish",
      "1 1/2 cups coarsely grated Pecorino Romano cheese (about 6 ounces), plus more for garnish"
    ],
    "instructions": "In a medium Dutch oven, warm the olive oil over medium-high heat until fragrant and shimmery. Add the garlic and cook, stirring frequently, until the garlic is fragrant and browned along the edges, 2 to 4 minutes. Add the zucchini, a large pinch of salt, and the water. Cover and cook, stirring occasionally until the zucchini collapses and grows wilted and soft, about 8 minutes. Uncover and cook until the water has evaporated and the zucchini has cooked down to a thick paste and has started to brown, 25 to 30 minutes. Meanwhile, cook the spaghetti in salted water until barely tender with a bite at the core. Reserve 2 cups pasta water, then drain. Add the drained pasta to the zucchini with 1 cup of the reserved pasta water, the chili flakes, mint, and cheese. Toss vigorously over medium heat until the pasta is coated and the sauce is creamy, adding more pasta water as needed. Serve topped with more mint and cheese.",
    "source": "Sohla Recipes.pdf",
    "servings": "6-8",
    "time": "50 minutes"
  },
  {
    "id": "20",
    "name": "Brioche Dinner Rolls",
    "category": "bread",
    "ingredients": [
      "4 cups all-purpose flour",
      "1 packet Fleischmann's RapidRise Instant Yeast",
      "1/4 cup granulated sugar",
      "1 1/2 teaspoons salt",
      "1 cup milk, warmed to 120 to 130F",
      "2 large eggs + 1 yolk",
      "1/2 cup unsalted butter, room temperature",
      "1 egg (for egg wash)"
    ],
    "instructions": "In the bowl of a stand mixer fitted with the paddle attachment, combine 3 cups of the flour, sugar, salt, and yeast. Make a well in the center and add the milk and eggs. Beat on medium high speed for 3 minutes. Change out the paddle for the dough hook and add the softened butter a little bit at a time, mixing well in between each addition. Add 1 more cup of flour and knead for 10 minutes in the mixer until the dough starts to smooth out. The dough will still be sticky but should pull away from the sides of the mixing bowl. Place in a greased bowl, cover with a dish cloth or plastic wrap and set aside to rise in a warm place for 1 hour. Once the dough has risen, turn it out onto a well floured surface and divide into 12 equal pieces. Roll each piece into a smooth ball and place in a greased 9 x 13 pan a few inches apart, 3 across and 4 down. Cover the pan and let rise for an hour. While the dough rises, preheat the oven to 350F and prepare your egg wash. Beat 1 egg with 1 teaspoon of water until homogenous. After the dough has risen, brush the rolls generously with the egg wash. Bake for 20 to 25 minutes or until golden brown and hollow sounding when tapped. Allow to cool before serving.",
    "source": "Brioche Dinner Rolls - Broma Bakery.pdf",
    "servings": "12 rolls",
    "time": "2 hours 45 minutes"
  },
  {
    "id": "21",
    "name": "Mandarin Orange Cranberry Sauce",
    "category": "sauce",
    "ingredients": [
      "24 ounces cranberries, fresh or frozen",
      "0.5 cup white granulated sugar, plus more as needed",
      "0.5 cup light brown sugar",
      "Juice and zest of 1 mandarin orange",
      "2 knobs of ginger, grated",
      "1 cup water, adjust depending on preferred consistency",
      "Pinch of salt"
    ],
    "instructions": "In a medium saucepan, add in your cranberries and toss with white sugar, brown sugar, orange zest and juice, grated ginger, water, and a pinch of salt. Stir to make sure everything is mixed and incorporated. Bring to a boil on medium-high heat, then bring to a gentle simmer on medium-low heat until the cranberries pop and create your sauce, about 15 minutes. You can use the back of your spoon to help pop the cranberries. You can adjust it with more water if you want a thinner sauce. If it's too tart, adjust with more sugar.",
    "source": "Easy Mandarin Orange Cranberry Sauce Recipe (in 20 Minutes) _ Lindsey Eats.pdf",
    "servings": "12",
    "time": "20 minutes"
  },
  {
    "id": "22",
    "name": "Tandem-Roast Chicken",
    "category": "chicken",
    "ingredients": [
      "2 tablespoons kosher salt",
      "2 tablespoons dried oregano",
      "1 teaspoon cayenne",
      "2 (3.5 to 4-pound) whole chickens",
      "Extra-virgin olive oil, for drizzling"
    ],
    "instructions": "Preheat the oven to 425°F. In a small bowl, mix salt, oregano, and cayenne. Fit a rimmed baking sheet with a wire rack, then place chickens on top. Season all sides and inside the cavities with spice mix, then drizzle with olive oil and rub it in evenly. Place the baking sheet in the oven and carefully pour in enough water to cover entire surface (about 1.5 cups should do it; this will prevent drippings from burning during roasting and throws a little bit of steam into the oven). Roast until the skin is browned and crisp and a thermometer inserted into the thickest part of the breast registers 155°F, about 55 minutes. Let sit 20 to 30 minutes before carving.",
    "source": "carla lalli music's recipes.pdf",
    "servings": "6-8",
    "time": "1 hour 30 minutes"
  },
  {
    "id": "23",
    "name": "Gingery Ground Beef with Lime and Herb",
    "category": "beef",
    "ingredients": [
      "2-inch piece ginger, peeled",
      "1 shallot, finely diced",
      "2 limes, juiced",
      "1/4 cup soy sauce",
      "2 tablespoons sriracha",
      "1 tablespoon fish sauce",
      "1 tablespoon vegetable oil",
      "1.5 pounds ground beef chuck",
      "Kosher salt",
      "4 garlic cloves, thinly sliced",
      "1 cup thinly sliced cilantro",
      "Cooked rice for serving (optional)",
      "Lettuce cups for serving (optional)"
    ],
    "instructions": "Prep all your ingredients before you cook. Peel the ginger and cut it into matchsticks. Thinly slice the garlic. Finely dice the shallot and put it in a small bowl, then add the juice of both limes. Add the soy sauce, sriracha, and fish sauce and stir to combine. Heat a large cast-iron or other heavy-bottomed skillet over high heat for 2 minutes. Add the oil and tilt to coat. Add the ground beef, season with salt, and immediately use a wooden spoon or metal spatula to smash the meat, flattening and breaking it into pieces. Cook, undisturbed, until the underside is browned and the beef is still juicy on top, 5 minutes. Add the ginger and garlic, toss to combine, and cook, stirring occasionally, until the ginger and garlic are golden and starting to crisp, 2 minutes more. Add the lime mixture and cook, stirring, until the sauce has reduced to a light glaze, about 3 minutes. Turn off the heat and toss in the cilantro. Serve with rice and/or lettuce cups for wrapping around the meat, if desired.",
    "source": "carla lalli music's recipes.pdf",
    "servings": "4",
    "time": "25 minutes"
  },
  {
    "id": "24",
    "name": "Extremely Green Grain Salad",
    "category": "salad",
    "ingredients": [
      "2 cups farro",
      "1 tablespoon kosher salt, plus more for seasoning",
      "Freshly ground black pepper",
      "1 bunch broccoli (2 stalks, about 1 pound)",
      "1/2 cup extra-virgin olive oil, plus more for drizzling",
      "1 bunch scallions (5.5 ounces)",
      "1 small bunch basil (about 2 ounces)",
      "1 small bunch parsley (about 2 ounces)",
      "2-inch piece fresh ginger",
      "1 cup raw cashews",
      "1 lime",
      "1/2 cup golden raisins"
    ],
    "instructions": "Rinse farro, then place in a medium pot and cover with 6 cups water. Add 1 tablespoon salt and a drizzle of oil and bring to a boil over medium-high. Lower the heat and simmer, stirring occasionally, until the grains are tender but still have a little chew, 35 to 45 minutes. Drain and spread out on a rimmed baking sheet to cool, tossing occasionally. While farro cooks, trim woody ends of the broccoli stems, then peel the stems. Roughly chop the broccoli stems and florets. Transfer broccoli to a food processor and pulse until finely chopped. Transfer to a medium bowl. Bring a small pot of water to a boil, season with salt. Trim scallions, then cut into 3-inch lengths. Boil scallions until softened and tender, 3 minutes. Use a slotted spoon to transfer them to a plate. Roughly chop the basil and parsley, then boil until wilted and tender, 2 minutes. Add herbs to plate with scallions. When cool enough to handle, squeeze excess liquid from scallions and herbs. Finely grate the ginger, then place it in a small strainer set over a small bowl and press with the back of a spoon to release the ginger juice. Pulse 3/4 cup cashews in food processor until finely chopped, then add the scallions and herbs. With motor running, drizzle in 1/2 cup oil. Cut lime in half and squeeze in juice. Add the ginger juice, then process the dressing until emulsified. Taste and season with salt and pepper. Combine the grains, broccoli, and dressing in a large bowl. Roughly chop raisins and remaining cashews; add to bowl. Toss to combine.",
    "source": "carla lalli music's recipes.pdf",
    "servings": "6",
    "time": "1 hour"
  },
  {
    "id": "25",
    "name": "Winter Squash with Crispy Sage and Honey",
    "category": "side",
    "ingredients": [
      "1 kabocha or 2 delicata squash (acorn will work too, or a mix), cut into 1/2-inch-thick slices, seeds removed if desired",
      "15 fresh sage leaves",
      "2 tablespoons extra-virgin olive oil",
      "2 tablespoons honey",
      "2 teaspoons kosher salt",
      "1/2 teaspoon freshly ground black pepper"
    ],
    "instructions": "Preheat the oven to 425°F. On a baking sheet, toss the squash and sage with the olive oil, honey, salt, and pepper. Roast until the squash is tender and golden, 20 to 25 minutes, flipping once about halfway through. Serve.",
    "source": "squash.pdf",
    "servings": "4",
    "time": "25 minutes"
  },
  {
    "id": "26",
    "name": "Buttered Rice with Shrimpy-Kimchi Tomato Sauce",
    "category": "seafood",
    "ingredients": [
      "1 cup short-grain white rice",
      "4 tablespoons (3 ounces) unsalted butter",
      "1 cup cabbage kimchi, roughly chopped",
      "1 pint cherry tomatoes (any color)",
      "1 pound large shrimp, peeled, deveined, and cut into 2-inch pieces",
      "Kosher salt",
      "1 small bunch basil"
    ],
    "instructions": "Place the rice in a fine-mesh strainer and rinse under cold running water until the water mostly runs clear, about 1 minute. Drain well, then combine the rice and 1.5 cups water in a small saucepan and place it over medium-high heat. As soon as the liquid is at a simmer, reduce the heat to medium-low, cover, and cook until the rice is tender and the water has been absorbed, 18 minutes. Meanwhile, melt butter in a medium saucepan over medium heat until it foams, then add the kimchi and any of its juices and cook, stirring occasionally, until the liquid is simmering, 3 minutes. Add the tomatoes and stir to coat. Simmer gently, stirring occasionally, until the tomato skins are wrinkled and tomatoes are starting to collapse, 3 to 4 minutes. Use the back of a wooden spoon to press gently on the tomatoes so they split and release their juices and simmer until the sauce is thickened, 3 minutes more. Add the shrimp to the sauce, lower the heat, and cook very gently, stirring occasionally, just until opaque, 5 minutes. Don't boil the shrimp—cooking them slowly keeps them tender and juicy! Taste the sauce and season with salt if needed. Thinly slice the basil. Fluff the rice with a fork, then gently mix in the herbs. Serve the rice with the shrimp sauce spooned over.",
    "source": "carla lalli music's recipes.pdf",
    "servings": "4",
    "time": "30 minutes"
  },
  {
    "id": "27",
    "name": "Roasted Vegetable Pasta Primavera",
    "category": "pasta",
    "ingredients": [
      "1 pound penne pasta",
      "2 zucchini, sliced",
      "2 yellow squash, sliced",
      "1 red bell pepper, diced",
      "1 pint cherry tomatoes",
      "1 small red onion, sliced",
      "4 tablespoons olive oil, divided",
      "Salt and pepper",
      "4 garlic cloves, minced",
      "1/2 cup white wine",
      "1/2 cup pasta water",
      "1/2 cup grated Parmesan",
      "1/4 cup fresh basil, torn"
    ],
    "instructions": "Preheat oven to 425F. Toss the zucchini, yellow squash, bell pepper, cherry tomatoes, and red onion with 2 tablespoons olive oil, salt, and pepper on a large sheet pan. Roast for 20-25 minutes until tender and lightly charred. Meanwhile, cook the pasta according to package directions. Reserve 1/2 cup pasta water before draining. In a large skillet, heat the remaining 2 tablespoons olive oil over medium heat. Add the garlic and cook for 30 seconds. Add the white wine and cook for 2 minutes. Add the roasted vegetables, drained pasta, and pasta water. Toss to combine. Stir in the Parmesan and basil. Season with salt and pepper. Serve immediately.",
    "source": "smitten kitchen.pdf",
    "servings": "6",
    "time": "40 minutes"
  },
  {
    "id": "28",
    "name": "Sheet Pan Chicken Fajitas",
    "category": "chicken",
    "ingredients": [
      "1.5 pounds boneless skinless chicken breasts, sliced into strips",
      "3 bell peppers (mixed colors), sliced",
      "1 large onion, sliced",
      "3 tablespoons olive oil",
      "2 tablespoons lime juice",
      "2 teaspoons chili powder",
      "1 teaspoon ground cumin",
      "1 teaspoon garlic powder",
      "1 teaspoon paprika",
      "1/2 teaspoon salt",
      "Flour tortillas",
      "Toppings: sour cream, guacamole, salsa, cheese, cilantro"
    ],
    "instructions": "Preheat oven to 400F. In a large bowl, whisk together olive oil, lime juice, chili powder, cumin, garlic powder, paprika, and salt. Add the chicken strips, peppers, and onion. Toss to coat everything evenly. Spread in a single layer on a large sheet pan. Bake for 20-25 minutes, stirring halfway through, until chicken is cooked through and vegetables are tender. Serve with warm tortillas and your favorite toppings.",
    "source": "Hot Sheet Recipes.pdf",
    "servings": "4-6",
    "time": "35 minutes"
  },
  {
    "id": "29",
    "name": "One-Pot Creamy Tuscan Chicken",
    "category": "chicken",
    "ingredients": [
      "4 boneless skinless chicken breasts",
      "2 teaspoons Italian seasoning",
      "1 teaspoon garlic powder",
      "Salt and pepper",
      "2 tablespoons olive oil",
      "4 garlic cloves, minced",
      "1 cup chicken broth",
      "1 cup heavy cream",
      "1/2 cup sun-dried tomatoes, chopped",
      "3 cups fresh spinach",
      "1/2 cup grated Parmesan cheese"
    ],
    "instructions": "Season chicken breasts with Italian seasoning, garlic powder, salt, and pepper. Heat olive oil in a large skillet over medium-high heat. Add chicken and cook for 5-6 minutes per side until golden and cooked through. Transfer to a plate. In the same skillet, add minced garlic and cook for 30 seconds. Add chicken broth and scrape up any browned bits. Add heavy cream and sun-dried tomatoes. Bring to a simmer. Add spinach and cook until wilted. Stir in Parmesan cheese. Return chicken to the skillet and spoon sauce over it. Simmer for 2-3 minutes. Serve over pasta, rice, or with crusty bread.",
    "source": "Brocc first 10 pages.pdf",
    "servings": "4",
    "time": "30 minutes"
  },
  {
    "id": "30",
    "name": "Beef and Mushroom Stroganoff",
    "category": "beef",
    "ingredients": [
      "1.5 pounds beef sirloin, sliced into thin strips",
      "Salt and pepper",
      "3 tablespoons butter, divided",
      "1 tablespoon olive oil",
      "1 large onion, sliced",
      "8 ounces cremini mushrooms, sliced",
      "3 garlic cloves, minced",
      "1 tablespoon flour",
      "1 cup beef broth",
      "1 tablespoon Worcestershire sauce",
      "1 cup sour cream",
      "Egg noodles for serving",
      "Fresh parsley for garnish"
    ],
    "instructions": "Season beef strips with salt and pepper. Heat 1 tablespoon butter and olive oil in a large skillet over high heat. Add beef and cook quickly until browned, about 2 minutes. Transfer to a plate. Reduce heat to medium. Add remaining butter, onion, and mushrooms. Cook until softened and browned, about 8 minutes. Add garlic and cook for 1 minute. Sprinkle flour over the vegetables and stir to coat. Add beef broth and Worcestershire sauce, scraping up any browned bits. Bring to a simmer and cook until slightly thickened, about 3 minutes. Remove from heat and stir in sour cream. Return beef to the skillet and toss to combine. Serve over egg noodles, garnished with parsley.",
    "source": "smitten kitchen keepers recipes.pdf",
    "servings": "4-6",
    "time": "35 minutes"
  }
]
